[About Language File]
Comments=Русская локализации для Text Editor Pro
Date=25.06.2022
Version=23.1.0

[AboutDialog]
Caption=О программе
LabelCopyright=Copyright %s. All rights reserved.
LabelFeedback=Обратная связь
LabelIcons=Иконки
LabelLanguageFileContributors=Переводчики
LabelLicense=Данный продукт для вас БЕСПЛАТЕН.
LabelMemoryAvailable=Объём системной памяти: %s
LabelThirdPartyComponents=Сторонние компоненты
LabelVersion=Версия %s (%d-бит)
LabelWebsite=Веб-сайт

[AskYesOrNo]
CancelSearch=Отменить поиск?
CheckInternationalCharacters:=Translation needed
CheckInternationalCharacters=File "%s" contains international characters.%sChange the encoding to keep the characters.%sSave anyway?
CloseDirectory=Закрыть каталог %s?
DeleteDirectory=Удалить каталог %s?
DeleteFile=Удалить файл %s?
DeleteLine=Удалить строку?
NewVersion=Доступна новая версия %s из %s.%sЗагрузить её из интернета?
RecordMacro=Записать новый макрос?
ReopenFileWithEncoding=Открыть повторно файл в кодировке "%s"?
ReplaceOccurence=Заменить это вхождение "%s"?
ResetColor=Cбросить цвет %s?
SaveChanges=Сохранить изменения?
SearchMatchNotFound=Соответствие не найдено.%sПерезапустить поиск с начала файла?
SearchStringNotFound=Строка "%s" не найдена

[ChangedFilesDialog]
Caption=Перезагрузить изменённые файлы
VirtualDrawTree:0=Файл
VirtualDrawTree:1=Путь

[CharacterMapForm]
Caption=Таблица символов

[ClipboardHistoryDialog]
ActionClearAll=Очистить всё
ActionCopyToClipboard=Копировать в буфер обмена
ActionInsertInEditor=Вставить в редактор
Caption=История буфера обмена

[ColorConstant]
SColorBoxCustomCaption=Задать...
SName3DDkShadow=Тёмный
SName3DLight=Светлый
SNameActiveBorder=Активная рамка
SNameActiveCaption=Активный заголовок
SNameAppWorkSpace=Рабочее пространство
SNameAqua=Аква
SNameBackground=Фон
SNameBlack=Чёрный
SNameBlue=Синий
SNameBtnFace=Лицевая сторона кнопки
SNameBtnHighlight=Подсветка кнопки
SNameBtnShadow=Тень кнопки
SNameBtnText=Текст кнопки
SNameCaptionText=Текст заголовка
SNameCream=Кремовый
SNameDefault=По умолчанию
SNameFuchsia=Розовый
SNameGradientActiveCaption=Градиент активного заголовка
SNameGradientInactiveCaption=Градиент неактивного заголовка
SNameGray=Серый
SNameGrayText=Серый текст
SNameGreen=Зелёный
SNameHighlight=Фон выделения
SNameHighlightText=Текст выделения
SNameHotLight=Тёплый свет
SNameInactiveBorder=Неактивная рамка
SNameInactiveCaption=Неактивный заголовок
SNameInactiveCaptionText=Текст неактивного заголовка
SNameInfoBk=Фон информации
SNameInfoText=Текст информации
SNameLime=Лайм
SNameMaroon=Бордовый
SNameMedGray=Дымчатый
SNameMenu=Фон меню
SNameMenuBar=Лента меню
SNameMenuHighlight=Подсветка меню
SNameMenuText=Текст меню
SNameMoneyGreen=Мята
SNameNavy=Тёмно-синий
SNameNone=Нет
SNameOlive=Оливковый
SNamePurple=Пурпурный
SNameRed=Красный
SNameScrollBar=Полоса прокрутки
SNameSilver=Серебряный
SNameSkyBlue=Лазурный
SNameTeal=Бирюзовый
SNameWhite=Белый
SNameWindow=Фон окна
SNameWindowFrame=Рамка окна
SNameWindowText=Текст окна
SNameYellow=Жёлтый

[CompareForm]
ActionExit:h=Выйти из сравнения текста
ActionExit=Выйти
ActionLeftCopy:h=Копировать выбранную строку в файл
ActionLeftCopy=Копировать
ActionLeftFileOpen:h=Открыть существующий файл
ActionLeftFileOpen=Открыть
ActionLeftFileSave:h=Сохранить файл
ActionLeftFileSave=Сохранить
ActionLeftNext:h=Перейти к следующему отличию
ActionLeftNext:s=F3
ActionLeftNext=Далее
ActionLeftPrevious:h=Перейти к предыдущему отличию
ActionLeftPrevious:s=Shift+F3
ActionLeftPrevious=Назад
ActionLeftReload:h=Перезагрузить текущий файл
ActionLeftReload=Перезагрузить
ActionLeftSwap:h=Заменить выбранную строку строкой из файла справа
ActionLeftSwap=Поменять
ActionOptions:h=Параметры сравнения текстов
ActionOptions=Параметры
ActionRightCopy:h=Копировать выбранную строку в файл слева
ActionRightCopy=Копировать
ActionRightFileOpen:h=Открыть существующий файл
ActionRightFileOpen=Открыть
ActionRightFileSave:h=Сохранить данный файл
ActionRightFileSave=Сохранить
ActionRightNext:h=Перейти к следующему отличию
ActionRightNext:s=F4
ActionRightNext=Далее
ActionRightPrevious:h=Перейти к предыдущему отличию
ActionRightPrevious:s=Shift+F4
ActionRightPrevious=Назад
ActionRightReload:h=Перезагрузить текущий файл
ActionRightReload=Перезагрузить
ActionRightSwap:h=Заменить выбранную строку строкой из файла слева
ActionRightSwap=Поменять
ActionSearchClose:h=Закрыть
ActionSearchFindNext:h=Найти следующий
ActionSearchFindNext:s=Ctrl+F3
ActionSearchFindPrevious:h=Найти предыдущий
ActionSearchFindPrevious:s=Shift+Ctrl+F3
ActionSearchMatchCase:h=Учитывать регистр
ActionSearchMatchCase=С учётом регистра
ActionSearchWholeWords:h=Сравнивать только слова целиком
ActionSearchWholeWords=Только целые слова
Caption=Сравнить тексты

[CompareOptionsDialog]
Caption=Параметры сравнения текстов
CheckBoxIgnoreBlanks=Игнорировать пробелы
CheckBoxIgnoreCase=Игнорировать регистр
CheckBoxShowSpecialChars=Показать cпец-символы
ComboBoxColorTheme=Цвет

[ConfirmReplaceDialog]
Caption=Подтвердить замену

[Constant]
Active=Включить
ActualSize=Актуальный размер
AddFile:t=Translation needed
AddFile=Add file
AllFiles=Все файлы
Arrow=Стрелка
AutoSave=Сохранение автоматически
Block=Блок
Blue:t=Translation needed
Blue=Blue
Bookmark=Закладка
Bookmarks=Закладки
Bottom=Снизу
Bytes=байт
CharacterCount=Количество символов
Circle=Круг
Color=Цвет
CompareFiles=Сравнить файлы
Confirmation=Подтверждение
Connecting=Соединение
CountingFiles=Подсчёт файлов...
Dash=Тире
Default=По умолчанию
DirectoryItems=Элементы каталога
DocumentIsValid=Действительный документ.
Dot=Точка
DoubleUnderline=Двойное подчеркивание
Download=Скачать
DownloadCancelling=Отмена...
DownloadDone=Готово
EditDirectory=Правка каталога
Encoding=Кодировка
Enter=Ввод
Error=Ошибка
Extended=Расширенный - \n, \t, \0
FavouriteItems=Избранные элементы
FileMaskItems=Элементы маски файла
FilesFound=Найдено %d файл(ов) в %s
FitHeight=Подогнать по высоте
FitWidth=Подогнать по ширине
Gigabyte=Гб
GoToBookmark=К закладке
GoToLine=К строке
Green:t=Translation needed
Green=Green
HalfBlock=Половина блока
Hide=Скрыть
Highlighter=Подсветка синтаксиса
HorizontalLine=Горизонтально
Hovered=Наведением курсора мыши
Inactive=Выключить
Information=Информация
Insert=Вставить
InsertTags=Вставить теги HTML/XML
Installer=Программа установки
InvalidName=Имя недействительно
Keyword=Ключевое слово
Kilobyte=Кб
LanguageEditor=Редактор языка - %s
Left=Слева
Length=Длина
Line=Строка
LineCount=Количество строк
LoadingFile=Загрузка файла...
LoadingFiles=Загрузка файлов...
LoadingOutput=Загрузка результата...
LowerCase=Нижний регистр
MatchFound=Найдено %d совпадений%s
MatchFoundPluralExtension=(ий)
Megabyte=Мб
Memory=Память
Minute=мин
Modified=Изменено
NewFolder=Новая папка
NoChange=Без изменений
None=Нет
Normal=Обычный
OccurencesFound=%d вхождений найдено в %s
Open=Открыть
OpenDirectory=Открыть каталог
Overwrite=Переписать
Page=Страница
Password=Пароль 
Pilcrow=Знак абзаца
PleaseWait=Немного подождите
Position=Позиция: %d
PreviewFilePage=Страницы: $PAGENUM$ из $PAGECOUNT$
PreviewPage=Страницы: %d из %d
PreviewPrintFile=Печать (%s)|Распечатать документ на %s
PrintedBy=Напечатано %s
ProcessingFile=Обработка файла...
Purple:t=Translation needed
Purple=Purple
ReadOnly=Только чтение
Red:t=Translation needed
Red=Red
RegularExpression=Регулярные выражения
Rename=Переименовать "%s" на "%s"?
RenameFailed=%s неудачных переименований
RenameTab:t=Translation needed
RenameTab=Rename tab
ReopenItems=Открыть элементы повторно
Results=Результат
Right=Справа
RightMargin=Правая граница
SaveAs=Сохранить как
Search=поиск
SearchFor=Найти "%s"
SearchItems=Найти элементы
Second=сек
SelectRootDirectory=Выбрать корневой каталог
SelectWorkingDirectory=Выбрать рабочий каталог
SentenceCase=С учётом регистра
Separator=Разделитель
ShowOnlyInList=Показать только в списке
Snippet=Фрагмент
Solid=Сплошной
Space=Пробел
Speed=Скорость
Square=Квадрат
Text=Текст
TextToFindItems=Текст для поиска элементов
ThinHorizontalLine=Горизонтальная тонкая линия
ThinVerticalLine=Вертикальная тонкая линия
ToggleBookmark=Переключить закладку
Top=Сверху
TopLine=Верхняя строка: %d
Triangle=Треугольник
Underline=Подчеркнуть
Untitled=Без названия
UpperCase=Верхний регистр
UseOnAllHighlighters=Использовать во всех подсветках синтаксиса
VersionInfoNotFound=Информация о версии не найдена.
VerticalLine=Вертикально
Warning=Предупреждение
WaveLine=Волнистая линия
WavyZigzag=Волнистый зигзаг
Width=Ширина
Wildcard=Маска - *, ?, #
WordCount=Количество слов
Yellow:t=Translation needed
Yellow=Yellow 
ZipPackage=Zip-архив

[ConvertConstant]
AcreFeet=Акр-фут
AcreInches=Акр-дюйм
Acres=Акры
Angstroms=Ангстрем
Area=Площадь
Ares=Ары
AstronomicalUnits=Астрономические единицы
Binary=Бинарные
Celsius=Цельсия
Centares=Контари
Centigrams=Сантиграммы
CentiLiters=Сантилитры
Centimeters=Сантиметры
Centuries=Центурии
Chains=Чейны
CordFeet=Корд-фут
Cords=Корды
CubicCentimeters=Кубические сантиметры
CubicDecameters=Кубические декаметры
CubicDecimeters=Кубические дециметры
CubicFeet=Кубические футы
CubicHectometers=Кубические гектометры
CubicInches=Кубические дюймы
CubicKilometers=Кубические километры
CubicMeters=Кубические метры
CubicMiles=Кубические мили
CubicMillimeters=Кубические миллиметры
CubicYards=Кубические ярды
Cubits=Кубиты
DateTime=Дата время
Days=Дни
Decades=Декады
Decagrams=Декаграммы
DecaLiters=Декалитры
Decameters=Декаметры
Decasteres=Декастеры
Decigrams=Дециграммы
DeciLiters=Децилитры
Decimal=Десятичный
Decimeters=Дециметры
Decisteres=Десистеры
Distance=Расстояние
Drams=Драхмы
DryBuckets=Стандартные контейнеры
DryBushels=Сухие бушели
DryGallons=Сухие галлоны
DryPecks=Сухие пеки
DryPints=Сухие пинты
DryQuarts=Сухие кварты
Fahrenheit=Фаренгейт
Fathoms=Морские са́жени
Feet=Фут
FluidCups=Чашки жидкости
FluidGallons=Галлоны жидкости
FluidGills=Джиллы жидкости
FluidOunces=Унции жидкости
FluidPints=Пинты жидкости
FluidQuarts=Кварты жидкости
FluidTablespoons=Столовые ложки жидкости
FluidTeaspoons=Чайные ложки жидкости
Fortnights=Фортнайты
Furlongs=Фурло́нги
Gigameters=Гигаметры
Grains=Граны
Grams=Граммы
Hands=Хэндсы
Hectares=Гектары
Hectograms=Гектограммы
HectoLiters=Гектолитры
Hectometers=Гектометры
Hexadecimal=Шестнадцатеричный
Hours=Часы
Inches=Дюймы
JulianDate=Юлианская дата
Kelvin=Kelvin
Kilograms=Килограммы
KiloLiters=Килолитры
Kilometers=Километры
LightYears=Световые годы
Links=Линки
Liters=Литры
LongTons=Английская тонна
Mass=Масса
Megameters=Мегаметры
Meters=Meters
MetricTons=Метрические тонны
Micrograms=Микрограммы
Micromicrons=Микромикроны
Microns=Микроны
Miles=Мили
Millennia=Миллениум
Milligrams=Миллиграммы
MilliLiters=Миллилитры
Millimeters=Миллиметры
Millimicrons=Миллимикроны
MilliSeconds=Миллисекунды
Minutes=Минуты
ModifiedJulianDate=Изменённая юлианская дата
Months=Месяцы
Nanograms=Нанограммы
NauticalMiles=Морские мили
NumeralSystem=Система счисления
Ounces=Унции
Paces=Шаги
Parsecs=Парсеки
Picas=Пики
Points=Точки
Pounds=Фунты
Rankine=Ранкина
Reaumur=Реомюра
Rods=Роды
Seconds=Секунды
SquareCentimeters=Квадратные сантиметры
SquareDecameters=Квадратные декаметры
SquareDecimeters=Квадратные дециметры
SquareFeet=Квадратные футы
SquareHectometers=Квадратные гектометры
SquareInches=Квадратные дюймы
SquareKilometers=Квадратные километры
SquareMeters=Квадратные метры
SquareMiles=Квадратные мили
SquareMillimeters=Квадратные миллиметры
SquareRods=Квадратные роды
SquareYards=Квадратные ярды
Steres=Стеры
Stones=Стоны
Temperature=Температура
Time=Время
Tons=Тонны
UKBuckets=UK вёдра
UKBushels=UK бушели
UKGallons=UK галлоны
UKGill=UK джилы
UKOunces=UK унции
UKPecks=UK пеки
UKPints=UK пинты
UKPottle=UK потлы
UKQuarts=UK кварты
Weeks=Недели
Volume=Объём
Yards=Ярды
Years=Годы

[ConvertForm]
Caption=Преобразование числовых единиц
ComboBoxFrom=Из
ComboBoxTo=В
ComboBoxType=Тип
EditResult=Результат
EditValue=Значение

[DialogConstant]
SMsgDlgAbort=Прервать
SMsgDlgAll=Все
SMsgDlgCancel=Отмена
SMsgDlgClose=Закрыть
SMsgDlgConfirm=Подтвердить
SMsgDlgError=Ошибка
SMsgDlgHelp=Справка
SMsgDlgHelpHelp=Справка
SMsgDlgHelpNone=Сравка недоступна
SMsgDlgIgnore=Игнорировать
SMsgDlgInformation=Информация
SMsgDlgNo=Нет
SMsgDlgNoToAll=Нет для всех
SMsgDlgOK=OK
SMsgDlgRetry=Повторить
SMsgDlgWarning=Предупреждение
SMsgDlgYes=Да
SMsgDlgYesToAll=Да для всех
SNoMappingForUnicodeCharacter=Отсутствует сопоставление символов Unicode на целевой многобайтовой кодовой странице

[DirectoryTabDialog]
CheckBoxExcludeOtherDirectoryBranches=Исключить другие ветки каталога
ComboBoxDrives=Диски
ComboBoxFileMask=Маска файла
EditRootDirectory=Корневой каталог
EditTabName=Имя вкладки
GroupBoxOptions=Опции

[DownloadURLDialog]
ActionCancel=Отмена
ActionOK=OK
Caption=Скачать

[EditorColorElements]
ActiveLineBackground=Фон активной строки
ActiveLineBackgroundUnfocused=Расфокусировка фона активной строки
ActiveLineForeground=Передний план активной строки
ActiveLineForegroundUnfocused=Расфокусировка переднего плана активной строки
Background=Фон
CodeFoldingActiveLineBackground=Фон активной строки свёртки кода
CodeFoldingActiveLineBackgroundUnfocused=Расфокусировка фона активной строки свёртки кода
CodeFoldingBackground=Фон свёртки кода
CodeFoldingCollapsedLine=Сворачивание строки свёртки кода
CodeFoldingFoldingLine=Свёрнутая строка свёртки кода
CodeFoldingFoldingLineHighlight=Выделение строки свёртки кода
CodeFoldingHintBackground=Фон посказки по свёртке кода
CodeFoldingHintBorder=Рамка подсказки по свёртке кода
CodeFoldingHintIndicatorBackground=Фон индикатора подсказки по свёртке кода
CodeFoldingHintIndicatorBorder=Рамка индикатора подсказки по свёртке кода 
CodeFoldingHintIndicatorMark=Метка индикатора подсказки по свёртке кода
CodeFoldingHintText=Текст подсказки по свёртке кода
CodeFoldingIndent=Отступ
CodeFoldingIndentHighlight=Выделение отступа свёртки кода
CompletionProposalBackground=Фон предложения заполнения
CompletionProposalForeground=Передний план предложения заполнения
CompletionProposalSelectedBackground=Фон выбранного предложения заполнения
CompletionProposalSelectedText=Текст выбранного предложения заполнения
LeftMarginActiveLineBackground=Фон левого поля активной строки
LeftMarginActiveLineBackgroundUnfocused=Фон левого поля активной строки вне фокуса
LeftMarginActiveLineNumber=Номер левого поля активной строки
LeftMarginBackground=Фон левого поля
LeftMarginBookmarkPanel=Панель закладок на левом поле
LeftMarginBorder=Граница левого поля
LeftMarginLineNumberLine=Строка номера строки левого поля
LeftMarginLineNumbers=Номера строк левого поля
LeftMarginLineStateModified=Состояние строки левого поля изменено
LeftMarginLineStateNormal=Состояние строки левого поля нормально
MatchingPairMatched=Пара совпадений найдена
MatchingPairUnmatched=Пара совпадений не найдена
MinimapBackground=Фон миникарты
MinimapBookmark=Закладка миникарты
MinimapVisibleLines=Показать строки миникарты
RightMargin=Правое поле
RightMovingEdge=Смещение правого края
RulerBackground=Фон линейки
RulerBorder=Рамка линейки
RulerLines=Линии линейки
RulerMovingEdge=Подвижный край линейки
RulerNumbers=Номера линейки
RulerSelection=Выбор линейки
SearchHighlighterBackground=Поиск фона подсветки синтаксиса
SearchHighlighterBorder=Поиск границы выделения
SearchHighlighterForeground=Поиск переднего плана подсветки синтаксиса
SearchInSelectionBackground=Поиск в фоне выбора
SearchMapActiveLine=Поиск активной линии карты
SearchMapBackground=Поиск фона карты
SearchMapForeground=Поиск переднего плана карты
SelectionBackground=Фон выделения
SelectionForeground=Выбор переднего плана
SyncEditBackground=Синхронизация фона редактирования
SyncEditEditBorder=Синхронизация границы редактирования
SyncEditWordBorder=Синхронизация границы редактируемого слова
WordWrapIndicatorArrow=Стрелка индикатора переноса слов
WordWrapIndicatorLines=Линии индикатора переноса слов

[ErrorMessage]
DefaultEmailProgramNotFound=Не удаётся найти программу отправки электронной почты.
DirectoryNotExist=Папка "%s" не существует.
EnterFilename=Введите имя файла.
EnterKeyword=Введите ключевое слово.
EnterPath=Введите путь.
EnterServer=Введите сервер.
EnterTabName=Введите имя вкладки.
FileNotFound=Файл "%s" не найден.
RootDirectoryNotExist=Корневой каталог не существует.

[ExecuteDialog]
ActionDelete:h=Удалить элемент
ActionDelete=Удалить
ActionEdit:h=Изменить элемент
ActionEdit=Правка
ActionInsert:h=Вставить элемент
ActionInsert=Вставить
ActionMoveDown:h=Переместить выбранный элемент вниз
ActionMoveDown=Переместить вниз
ActionMoveUp:h=Переместить выбранный элемент вверх
ActionMoveUp=Переместить вверх
ActionSort:h=Сортировка элементов
ActionSort=Сортировать
Caption=Выполнение элементов

[ExecuteEditDialog]
Caption=Запустить элемент
CheckBoxSaveActiveFile=Сохранить активный файл
CheckBoxShowOutput=Показать вывод
ComboBoxShortcut=Ярлык
EditFilename=Имя файла
EditParameters=Параметры
EditTitle=Заголовок
EditWorkingDirectory=Рабочая папка

[FilesSelectDialog]
ActionSelectAll:h=Выбрать все файлы
ActionSelectAll=Выбрать всё
ActionUnselectAll:h=Сбросить выбор всех файлов
ActionUnselectAll=Сбросить всё
Caption=Выбор файлов
VirtualDrawTree:0=Файл
VirtualDrawTree:1=Путь

[FileTypes]
7Zip=Файлы 7-Zip (*.7z)|*.7z
ABAP=Файлы ABAP (*.abap)
ActionScript=Файлы ActionScript (*.as)
ASP=Файлы ASP (*.asp)
Assembler - 6502=Файлы ассемблера 6502 (*.asm)
Assembler - 68HC11=Файлы ассемблера 68HC11 (*.hc11;*.asc)
AutoHotkey=Файлы AutoHotkey (*.ahk)
AutoIt v3=Файлы AutoIt (*.au3)
AWK=Файлы AWK (*.awk)
Bash=Файлы Bash (*.sh)
C#=Файлы C# (*.cs)
C++=Файлы C++ (*.cpp;*.hpp)
C=Файлы C (*.c;*.h)
Clojure=Файлы Clojure (*.clj;*.cljs;*.cljc;*.edn)
CoffeeScript=Файлы CoffeeScript (*.coffee)
CSS=Файлы CSS (*.css)
D=Файлы D (*.d;*.di)
Dart=Файлы Dart (*.dart)
Delphi Form Module=Файлы модулей форм Delphi (*.dfm)
Diff=Файлы Difference (*.diff)
DWScript=Файлы DWScript (*.dws)
Eiffel=Файлы Eiffel (*.e;*.es)
Elixir=Файлы Elixir (*.exs)
Elm=Файлы Elm (*.elm)
Erlang=Файлы Erlang (*.erl;*.hrl)
Euphoria=Файлы Euphoria (*.e;*.ex;*.exw;*.edb)
Exe=Файлы приложений (*.exe)|*.exe
F#=Файлы F# (*.fs)
Free Pascal=Файлы Free Pascal (*.pp)
FreeBASIC=Файлы FreeBASIC (*.bi;*.bas)
GDScript=Файлы GDScript (*.gd)
Git Ignore=Файлы Git Ignore (*.gitignore)
GLSL=Файлы GLSL (*.glsl)
Go=Файлы Go (*.go)
Gravity=Файлы Gravity (*.gravity)
Groovy=Файлы Groovy (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=Файлы HTML (*.html;*.htm)
INI=Файлы INI (*.ini;*.lng)
Inno Setup=Файлы Inno Setup (*.iss)
Java=Файлы Java (*.java)
JavaScript=Файлы JavaScript (*.js)
JSON=Файлы JSON (*.json)
Julia=Файлы Julia (*.jl)
Kotlin=Файлы Kotlin (*.kt;*.kts)
Language=Языковые файлы (*.lng)|*.lng
LaTex=Файлы LaTex (*.lat;*.tex;*.lex)
Lisp=Файлы Lisp (*.lisp)
Log file=Файлы Log (*.log)
Lua=Файлы Lua (*.lua)
Macro=Файлы Macro (*.mcr)|*.mcr
Markdown=Файлы Markdown (*.md)
MATLAB=Файлы MATLAB (*.matlab)
MIME=Файлы MIME (*.eml;*.mht)
MS-DOS Batch=Файлы командной строки MS-DOS (*.bat;*.cmd)
MSI=Файлы MSI (*.msi)|*.msi
NSIS=Файлы NSIS (*.nsi)
Object Pascal=Файлы Pascal (*.pas;*.dpr;*.dpk)
Objective-C=Файлы Objective-C (*.m)
OCaml=Файлы OCaml (*.ml)
PDF=Файлы PDF (*.pdf)
Perl=Файлы Perl (*.pl;*.pm;*.cgi)
PHP=Файлы PHP (*.php;*.class;*.inc)
PowerShell=Файлы PowerShell (*.ps1)
Python=Файлы Python (*.py)
R=Файлы R (*.r;*.rdata;*.rds;*.rda)
Red=Файлы Red (*.red;*.reds)
Ruby=Файлы Ruby (*.rb;*.rbw)
Rust=Файлы Rust (*.rc)
Scala=Файлы Scala (*.scala)
SQL - Standard=Файлы SQL (*.sql)
Structured Text=Файлы Structured Text (*.st; *.iecst)
Swift=Файлы Swift (*.swift)
TclTk=Файлы Tcl/Tk (*.tcl)
Text=Текстовые файлы (*.txt)
TypeScript=Файлы TypeScript (*.ts)
UnrealScript=Файлы UnrealScript (*.uc)
Visual Basic=Файлы Visual Basic (*.vb;*.bas)
Visual FoxPro=Файлы Visual FoxPro (*.pjx;*.prg)
VRCalc++=Файлы VRCalc++ (*.vrc;*.vrcm)
XML=Файлы XML (*.xml;*.xsd;*.csl;*.dtd;*.dproj;*.groupproj;*.opml;*.rdf;*.svg;*.wxs)
XSL=Файлы XSL (*.xsl;*.xslt)
YAML=Файлы YAML (*.yml)
Zip=Файлы Zip (*.zip)|*.zip

[FindDuplicatesDialog]
ActionDirectoryItems=Элементы каталога...
ActionFileMaskItems=Элементы маски файла...
Caption=Найти дубликаты
CheckBoxIgnoreBlanks=Игрорировать пробелы
CheckBoxIgnoreCase=Игнорировать регистр
CheckBoxIncludeSubdirectories=Искать во вложенных папках
CheckBoxScanHorizontally=Сканировать горизонтально
CheckBoxScanVertically=Сканировать вертикально
ComboBoxDirectories=Папки
ComboBoxFileMask=Тип файла
GroupBoxOptions=Опции
GroupBoxSearch=Поиск
GroupBoxSearchDirectoryOptions=Параметры поиска в каталоге
RadioButtonSearchAllOpenFiles=Поиск во всех открытых файлах
RadioButtonSearchInDirectories=Поиск в папках
SpinEditMinimumBlockSize=Минимальный размер блока
SpinEditMinimumCharacters=Минимум символов

[FindInFilesDialog]
ActionDirectoryItems=Элементы каталога...
ActionFileMaskItems=Элементы маски файла...
ActionSearchEngine=Выбрать движок поиска
ActionTextToFindItems=Текст поиска элементов...
Caption=Поиск в файлах
CheckBoxDisplayResultsInSeparateTab=Отображать результаты на отдельной вкладке
CheckBoxGroupResultsByFile=Группировать результаты по файлам
CheckBoxIncludeSubdirectories=Просмотреть во вложенных папках
CheckBoxMatchCase=С учётом регистра
CheckBoxShowOnlyResult=Показать только результат
CheckBoxWholeWords=Только слова целиком
ComboBoxDirectories:h=Несколько каталогов разделены точкой с запятой
ComboBoxDirectories=Папки
ComboBoxFileMask=Тип файла
ComboBoxTextToFind=Найти
GroupBoxOptions=Опции
GroupBoxOutputOptions=Вывод
GroupBoxSearch=Поиск
GroupBoxSearchDirectoryOptions=Параметры поиска в каталоге
RadioButtonSearchAllOpenFiles=Поиск во всех открытых файлах
RadioButtonSearchInCurrentFile:t=Translation needed
RadioButtonSearchInCurrentFile=In current file
RadioButtonSearchInDirectories=Поиск в папках

[HighlighterColorElements]
AssemblerComment=Комментарий ассемблера
AssemblerReservedWord=Зарезервированное слово ассемблера
Attribute=Атрибут
Character=Буква
Comment=Комментарий
Directive=Предписание
Editor=Редактор
HexNumber=Hex-число
HighlightedBlock=Выделенный блок
HighlightedBlockSymbol:t=Translation needed
HighlightedBlockSymbol=Highlighted block symbol
LogicalOperator:t=Translation needed
LogicalOperator=Logical operator
Method:t=Translation needed
Method=Method
MethodItalic:t=Translation needed
MethodItalic=Method italic
MethodName:t=Translation needed
MethodName=Method name
Number=Число
ReservedWord=Зарезервированное слово
String=Строка
Symbol=Символ
Value:t=Translation needed
Value=Value
WebLink:t=Translation needed
WebLink=Web link

[HighlighterFontElements]
CodeFoldingHint=Подсказка по сворачиванию кода
CompletionProposal=Предложение заполнения строки
LineNumbers=Номера строк
Minimap=Миникарта
Ruler=Линейка
Text=Текст

[InformationDialog]
Caption=Информация
LabelAccessed=Доступен
LabelCharacterCount=Всего символов
LabelCreated=Создан
LabelFilename=Имя файла
LabelLength=Длина
LabelLineCount=Всего строк
LabelLocation=Расположение
LabelModified=Изменён
LabelSize=Размер
LabelSizeOnDisk=Размер на диске
LabelWordCount=Всего слов

[Buttons]
ButtonCancel=Отмена
ButtonDonations=Пожертвования
ButtonDownloadAllSkins=Скачать все обложки
ButtonLicense=Лицензия...
ButtonNo=Нет
ButtonOK=OK
ButtonYes=Да
ButtonYesToAll=Да для всех

[ItemListDialog]
ActionClearAll:h=Очистить все элементы
ActionClearAll=Очистить всё
ActionDelete:h=Удалить элемент
ActionDelete=Удалить
ActionInsert:h=Вставить элемент
ActionInsert=Вставить
ActionMoveDown:h=Переместить выбранный элемент вниз
ActionMoveDown=Переместить вниз
ActionMoveUp:h=Переместить выбранный элемент вверх
ActionMoveUp=Переместить вверх
ActionSort:h=Сортировать элементы
ActionSort=Сортировать

[LanguageEditorForm]
ActionExit:h=Закрыть редактор
ActionExit=Выйти
ActionFileNew:h=Создать новый файл локализации
ActionFileNew=Создать
ActionFileOpen:h=Открыть существующий файл локализации
ActionFileOpen=Открыть
ActionFileSave:h=Сохранить файл локализации
ActionFileSave=Сохранить
VirtualDrawTree:0=Объект
VirtualDrawTree:1=Подпись
VirtualDrawTree:2=Подсказка
VirtualDrawTree:3=Ярлык
VirtualDrawTree:4=Второй ярлык

[MainForm]
ActionBookmarkListShowFilters:t=Translation needed
ActionBookmarkListShowFilters=Show filters
ActionDirectoryContextMenu:h=Контекстное меню
ActionDirectoryContextMenu=Контекстное меню
ActionDirectoryDelete:h=Удалить файл или каталог
ActionDirectoryDelete=Удалить
ActionDirectoryFileExplorer:h=Открыть проводник
ActionDirectoryFileExplorer=Проводник
ActionDirectoryFindInFiles:h=Поиск строки в нескольких файлах
ActionDirectoryFindInFiles=Поиск в файлах...
ActionDirectoryNewFolder=Новая папка
ActionDirectoryOpenAllFiles:h=Открыть все файлы в каталоге
ActionDirectoryOpenAllFiles=Открыть все файлы
ActionDirectoryOpenFileExplorer:h=Открыть проводник
ActionDirectoryOpenFileExplorer=Проводник
ActionDirectoryProperties:h=Просмотр свойств файла/папки
ActionDirectoryProperties=Свойства...
ActionDirectoryRefresh:h=Обновить файлы
ActionDirectoryRefresh=Обновить
ActionDirectoryRename:h=Переименование файла/папки
ActionDirectoryRename=Переименовать
ActionDirectorySFTPDownload=Скачать
ActionDirectorySFTPUpload=Загрузить
ActionEdit=Правка
ActionEditCopy:h=Копировать выделенный фрагмент в буфер обмена
ActionEditCopy:s=Ctrl+C
ActionEditCopy=Копировать
ActionEditCopyWithLineNumbers:h=Копировать выделенный фрагмент в буфер обмена
ActionEditCopyWithLineNumbers:s=Ctrl+Alt+C
ActionEditCopyWithLineNumbers=Копировать с номерами строк
ActionEditCut:h=Вырезать выделенный фрагмент в буфер обмена
ActionEditCut:s=Ctrl+X
ActionEditCut=Вырезать
ActionEditDecode:h=Декодировать
ActionEditDecode=Декодировать
ActionEditDecodeASCIIDecimal:h=Декодирование ASCII десятичный
ActionEditDecodeASCIIDecimal=ASCII десятичный
ActionEditDecodeBase1024:h=Декодирование базовый1024
ActionEditDecodeBase1024=1024
ActionEditDecodeBase128:h=Декодирование базовый128
ActionEditDecodeBase128=128
ActionEditDecodeBase256:h=Декодирование базовый256
ActionEditDecodeBase256=256
ActionEditDecodeBase32:h=Декодирование базовый32
ActionEditDecodeBase32=32
ActionEditDecodeBase4096:h=Декодирование базовый4096
ActionEditDecodeBase4096=4096
ActionEditDecodeBase64:h=Декодирование базовый64
ActionEditDecodeBase64=64
ActionEditDecodeBase85:h=Декодирование базовый85
ActionEditDecodeBase85=85
ActionEditDecodeBase91:h=Декодирование базовый91
ActionEditDecodeBase91=91
ActionEditDecodeBase:h=Декодирование базовый
ActionEditDecodeBase=Базовый
ActionEditDecodeBinary:h=Декодирование бинарный
ActionEditDecodeBinary=Бинарный
ActionEditDecodeHex:h=Декодирование Hex
ActionEditDecodeHex=Hex
ActionEditDecodeHexWithoutSpaces:h=Декодирование Hex без пробелов
ActionEditDecodeHexWithoutSpaces=Hex (без пробелов)
ActionEditDecodeHTML:h=Декодирование HTML
ActionEditDecodeHTML=HTML
ActionEditDecodeOctal:h=Декодирование восьмеричное
ActionEditDecodeOctal=Восьмеричный
ActionEditDecodeRotate13:h=Вращение на 13 позиций
ActionEditDecodeRotate18:h=Вращение на 18 позиций
ActionEditDecodeRotate47:h=Вращение на 47 позиций
ActionEditDecodeRotate5:h=Вращение на 5 позиций
ActionEditDecodeRotate:h=Вращающееся дешифрование
ActionEditDecodeRotate=Вращение
ActionEditDecodeURL:h=Декодировать URL-адрес
ActionEditDecodeURL=URL
ActionEditDelete=Удалить
ActionEditDeleteBeginningOfLine:h=Удалить начало строки
ActionEditDeleteBeginningOfLine:s=Shift+Ctrl+T
ActionEditDeleteBeginningOfLine=Начало строки
ActionEditDeleteComments:h=Удалить комментарии
ActionEditDeleteComments=Комментарии
ActionEditDeleteDuplicateLines:h=Удалить повторяющиеся строки
ActionEditDeleteDuplicateLines=Повторяющиеся строки
ActionEditDeleteEndOfLine:h=Удалить конец строки
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=Конец строки
ActionEditDeleteLine:h=Удалить строку
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=Строку
ActionEditDeleteWhitespace:h=Удалить в выделенном тексте все пробелы
ActionEditDeleteWhitespace=Пробелы
ActionEditDeleteWord:h=Удалить слово
ActionEditDeleteWord:s=Ctrl+W
ActionEditDeleteWord=Слово
ActionEditDeleteWordBackward:h=Удалить предыдущее слово
ActionEditDeleteWordBackward:s=Ctrl+BkSp
ActionEditDeleteWordBackward=Предыдущее слово
ActionEditDeleteWordForward:h=Удалить следующее слово
ActionEditDeleteWordForward:s=Ctrl+Del
ActionEditDeleteWordForward=Следующее слово
ActionEditEncode:h=Кодировать
ActionEditEncode=Кодировать
ActionEditEncodeASCIIDecimal:h=Кодирование ASCII десятичный
ActionEditEncodeASCIIDecimal=ASCII десятичный
ActionEditEncodeBase1024:h=Кодирование в базовый1024
ActionEditEncodeBase1024=1024
ActionEditEncodeBase128:h=Кодирование в базовый128
ActionEditEncodeBase128=128
ActionEditEncodeBase256:h=Кодирование в базовый256
ActionEditEncodeBase256=256
ActionEditEncodeBase32:h=Кодирование в базовый32
ActionEditEncodeBase32=32
ActionEditEncodeBase4096:h=Кодирование в базовый4096
ActionEditEncodeBase4096=4096
ActionEditEncodeBase64:h=Кодирование в базовый64
ActionEditEncodeBase64=64
ActionEditEncodeBase64WithLineBreaks:h=Кодировать в базовый64 с переносом строк
ActionEditEncodeBase64WithLineBreaks=64 (с переносом строк)
ActionEditEncodeBase85:h=Кодирование в базовый85
ActionEditEncodeBase85=85
ActionEditEncodeBase91:h=Кодирование в базовый91
ActionEditEncodeBase91=91
ActionEditEncodeBase:h=Кодирование в базовый
ActionEditEncodeBase=Базовый
ActionEditEncodeBinary:h=Кодирование в бинарный
ActionEditEncodeBinary=Бинарный
ActionEditEncodeHex:h=Кодирование в Hex
ActionEditEncodeHex=Hex
ActionEditEncodeHexWithoutSpaces:h=Кодировать в Hex без пробелов
ActionEditEncodeHexWithoutSpaces=Hex (без пробелов)
ActionEditEncodeHTML:h=Кодировать в HTML
ActionEditEncodeHTML=HTML
ActionEditEncodeOctal:h=Кодирование в восьмиричный
ActionEditEncodeOctal=Восьмиричный
ActionEditEncodeRotate13:h=Вращение на 13 позиций
ActionEditEncodeRotate18:h=Вращение на 18 позиций
ActionEditEncodeRotate47:h=Вращение на 47 позиций
ActionEditEncodeRotate5:h=Вращение на 5 позиций
ActionEditEncodeRotate:h=Вращающееся шифрование
ActionEditEncodeRotate=Вращение
ActionEditEncodeURL:h=Кодирование URL-адреса
ActionEditEncodeURL=URL
ActionEditFormatJSON=Формат JSON
ActionEditFormatJSONIndent2:h=Формат JSON
ActionEditFormatJSONIndent2:s=Ctrl+Shift+J
ActionEditFormatJSONIndent2=Отступ 2
ActionEditFormatJSONIndent3=Отступ 3
ActionEditFormatJSONIndent4=Отступ 4
ActionEditFormatJSONMinify=Минимизировать
ActionEditFormatSQL:h=Формат SQL
ActionEditFormatSQL=Формат SQL
ActionEditFormatXML=Формат XML
ActionEditFormatXMLFormat:h=Формат XML
ActionEditFormatXMLFormat:s=Ctrl+Shift+X
ActionEditFormatXMLFormat=Формат
ActionEditFormatXMLMinify=Минимизировать
ActionEditIndentDecrease:h=Уменьшить отступ
ActionEditIndentDecrease:s=Shift+Ctrl+U
ActionEditIndentDecrease=Уменьшить отступ
ActionEditIndentIncrease:h=Увеличить отступ
ActionEditIndentIncrease:s=Shift+Ctrl+I
ActionEditIndentIncrease=Увеличить отступ
ActionEditInsert=Вставить
ActionEditInsertBlockComment:h=Переключить блок комментария. Комбинация клавиш — Ctrl+Shift+VK_OEM_2. Виртуальная клавиша VK_OEM_2 может отличаться в зависимости от раскладки клавиатуры. Для стандартной раскладки США это клавиша '/?'.
ActionEditInsertBlockComment=Блок комментария
ActionEditInsertDateTime:h=Вставить дату и время
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=Дату и время
ActionEditInsertGUID:h=Вставить GUID
ActionEditInsertGUID:s=Shift+Ctrl+G
ActionEditInsertGUID=GUID
ActionEditInsertHexColor:h=Цвет в Hex-коде
ActionEditInsertHexColor:s=Shift+Alt+C
ActionEditInsertHexColor=Цвет Hex
ActionEditInsertLine:h=Вставить строку
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=Строку
ActionEditInsertLineComment:h=Переключить комментарий строки. Комбинация клавиш — Ctrl+VK_OEM_2. Виртуальная клавиша VK_OEM_2 может отличаться в зависимости от раскладки клавиатуры. Для стандартной раскладки EN это '/?'.
ActionEditInsertLineComment=Комментарий строки
ActionEditInsertNull:h=Вставить нулевой символ
ActionEditInsertNull:s=Shift+Ctrl+N
ActionEditInsertNull=Нулевой символ
ActionEditInsertTag:h=Вставить теги HTML/XML
ActionEditInsertTag:s=Ctrl+T
ActionEditInsertTag=Теги HTML/XML...
ActionEditModify=Модификация
ActionEditModifyJoin:h=Объединить текст с разделителем
ActionEditModifyJoin=Объединить
ActionEditModifyLineWrap:h=Перенести строки по ширине
ActionEditModifyLineWrap=Перенос строк
ActionEditModifySpacesToTabs:h=Преобразовать все пробелы в табуляции
ActionEditModifySpacesToTabs=Пробелы в табуляции
ActionEditModifySplit:h=Разделение текста разделителем
ActionEditModifySplit=Разделить
ActionEditModifyTabsToSpaces:h=Преобразовать все табуляции в пробелы
ActionEditModifyTabsToSpaces=Табуляции в пробелы
ActionEditMove=Переместить
ActionEditMoveLineDown:h=Переместить строку вниз
ActionEditMoveLineDown:s=Shift+Ctrl+Down
ActionEditMoveLineDown=Строку вниз
ActionEditMoveLineUp:h=Переместить строку вверх
ActionEditMoveLineUp:s=Shift+Ctrl+Up
ActionEditMoveLineUp=Строку вверх
ActionEditMoveNextWord:h=Перейти к следующему слову
ActionEditMoveNextWord:s=Ctrl+Right
ActionEditMoveNextWord=Следующее слово
ActionEditMovePreviousWord:h=Перейти к предыдущему слову
ActionEditMovePreviousWord:s=Ctrl+Left
ActionEditMovePreviousWord=Предыдущее слово
ActionEditMoveSelectionDown:h=Переместить выделение вниз
ActionEditMoveSelectionDown:s=Shift+Alt+Down
ActionEditMoveSelectionDown=Выделенное вниз
ActionEditMoveSelectionLeft:h=Переместить выделение влево
ActionEditMoveSelectionLeft:s=Shift+Alt+Left
ActionEditMoveSelectionLeft=Выделенное влево
ActionEditMoveSelectionRight:h=Переместить выделение вправо
ActionEditMoveSelectionRight:s=Shift+Alt+Right
ActionEditMoveSelectionRight=Выделенное вправо
ActionEditMoveSelectionUp:h=Переместить выделение вверх
ActionEditMoveSelectionUp:s=Shift+Alt+Up
ActionEditMoveSelectionUp=Выделенное вверх
ActionEditPaste:h=Вставить содержимое буфера обмена
ActionEditPaste:s=Ctrl+V
ActionEditPaste=Вставить
ActionEditRedo:h=Повторить последнее отменённое действие
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=Повторить
ActionEditSelectAll:h=Выбрать всё
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=Выбрать всё
ActionEditSort=Сортировать
ActionEditSortAsc:h=Сортировать по возрастанию
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=По возрастанию
ActionEditSortDesc:h=Сортировать по убыванию
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=По убыванию
ActionEditSortRandom:h=Сортировать в случайном порядке
ActionEditSortRandom=Случайно
ActionEditToggleCase:h=Переключение регистра
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=Регистр
ActionEditToggleCaseAlternating:h=Переключение регистра поочередно
ActionEditToggleCaseAlternating=Чередовать
ActionEditToggleCaseLower:h=Переключение в нижний регистр
ActionEditToggleCaseLower:s=Ctrl+L
ActionEditToggleCaseLower=Нижний регистр
ActionEditToggleCaseSentence:h=Переключение регистра фразы
ActionEditToggleCaseSentence=Фраза
ActionEditToggleCaseTitle:h=Переключение регистра заголовка
ActionEditToggleCaseTitle=Заголовок
ActionEditToggleCaseUpper:h=Переключение в верхний регистр
ActionEditToggleCaseUpper:s=Ctrl+U
ActionEditToggleCaseUpper=Верхний регистр
ActionEditTrim=Удаление пробелов
ActionEditTrimBoth:h=Убрать пробелы слева и справа
ActionEditTrimBoth=Везде
ActionEditTrimLeft:h=Убрать пробелы слева
ActionEditTrimLeft=Слева
ActionEditTrimRight:h=Убрать пробелы справа
ActionEditTrimRight=Справа
ActionEditUndo:h=Отменить последнее действие
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=Отменить
ActionEditValidateXML=Проверить XML
ActionFile=Файл
ActionFileAddToFavourites:h=Добавить файл в избранное
ActionFileAddToFavourites:s=Ctrl+D
ActionFileAddToFavourites=Добавить в избранное
ActionFileCanClose:h=Выбрать возможность закрыть вкладку
ActionFileCanClose=Можно закрыть
ActionFileClose=Закрыть
ActionFileCloseActive:h=Закрыть активный документ
ActionFileCloseActive:s=Ctrl+F4
ActionFileCloseActive=Включить
ActionFileCloseAll:h=Закрыть все открытые файлы
ActionFileCloseAll=Все
ActionFileCloseAllOther:h=Закрыть все другие страницы
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=Bсе другие
ActionFileCloseModified:h=Закрыть изменённые файлы
ActionFileCloseModified=Изменённые
ActionFileCloseSelected:h=Закрыть выбранные файлы
ActionFileCloseSelected=Выбранные
ActionFileCloseUnmodified:h=Закрыть файлы без изменений
ActionFileCloseUnmodified=Без изменений
ActionFileContextMenu=Контекст-меню
ActionFileExit:h=Закрыть приложение
ActionFileExit:s=Alt+F4
ActionFileExit:s2=ESC
ActionFileExit=Выйти
ActionFileFavourites=Избранное
ActionFileFavouritesProperties=Свойства...
ActionFileHTMLExport:h=Экспорт файла в HTML
ActionFileHTMLExport=Экспорт в HTML
ActionFileInfo:h=Информация активного файла
ActionFileInfo=Информация
ActionFileMoveCaretAtTheEndAfterReload:h=Перемещение курсора в конец после перезагрузки
ActionFileMoveCaretAtTheEndAfterReload=Переместить курсор в конец после перезагрузки
ActionFileNew:h=Создать новый документ
ActionFileNew:s=Ctrl+N
ActionFileNew=Новый
ActionFileOpen:h=Открыть существующий документ
ActionFileOpen:s=Ctrl+O
ActionFileOpen=Открыть...
ActionFileOpenCommandPrompt:h=Открыть окно командной строки
ActionFileOpenCommandPrompt=Консоль
ActionFileOpenFileExplorer:h=Открыть проводник
ActionFileOpenFileExplorer=Проводник
ActionFileOpenInBrowser:h=Просмотр текущего документа в браузере по умолчанию
ActionFileOpenInBrowser:s=Alt+B
ActionFileOpenInBrowser=Браузер
ActionFilePrint:h=Печать активного документа
ActionFilePrint:s=Ctrl+P
ActionFilePrint=Печать...
ActionFilePrintPreview:h=Предварительный просмотр активного документа
ActionFilePrintPreview=Просмотр печати
ActionFileProperties:h=Свойства файла
ActionFileProperties=Свойства...
ActionFileReadOnly:h=Переключить редактор к 'Только для чтения'
ActionFileReadOnly=Только для чтения
ActionFileReloadAutomatically:h=Включить автоматическую перезагрузку редактора
ActionFileReloadAutomatically=Обновлять автоматически
ActionFileRemoveFromFavourites=Удалить из Избранного
ActionFileRenameTab:t=Translation needed
ActionFileRenameTab=Rename tab
ActionFileReopen=Открыть повторно
ActionFileReopenProperties=Свойства...
ActionFileSave:h=Сохранить изменения в текущем документе
ActionFileSave:s=Ctrl+S
ActionFileSave=Сохранить
ActionFileSaveAll:h=Сохраните все документы
ActionFileSaveAll:s=Shift+Alt+S
ActionFileSaveAll=Сохранить всё
ActionFileSaveAs:h=Сохранить активный документ с новым именем
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=Сохранить как...
ActionFileSelectFromDirectory:h=Выбрать файл из активного каталога
ActionFileSelectFromDirectory=Выбрать из каталога
ActionFileTrimTrailingSpaces:h=Вкл/выкл удаление пробелов в конце
ActionFileTrimTrailingSpaces=Обрезать завершающие пробелы
ActionFileUpload=Загрузить
ActionGotoNextBookmark:h=Перейти к следующей закладке
ActionGotoNextBookmark:s=F2
ActionGotoNextBookmark=Следующая
ActionGotoPreviousBookmark:h=Перейти к предыдущей закладке
ActionGotoPreviousBookmark:s=Shift+F2
ActionGotoPreviousBookmark=Предыдущая
ActionHelp=Помощь
ActionHelpAboutTextEditorPro:h=Показать информацию о Text Editor Pro
ActionHelpAboutTextEditorPro=О программе
ActionHelpCheckForUpdates:h=Проверка наличия обновлений
ActionHelpCheckForUpdates=Проверить обновления
ActionHelpSendFeedback:h=Отправить отзыв на info@texteditor.pro
ActionHelpSendFeedback=Отправить отзыв
ActionHelpShortcuts:h=Показать сочетания клавиш
ActionHelpShortcuts:s=Ctrl+F1
ActionHelpShortcuts=Горячие клавиши
ActionHelpVisitHomepage:h=Посетить домашнюю страницу Text Editor Pro - https://texteditor.pro
ActionHelpVisitHomepage=Домашняя страница
ActionImageViewRotateClockwise:h=Повернуть страницу по часовой стрелке
ActionImageViewRotateCounterClockwise:h=Повернуть страницу против часовой стрелки
ActionImageViewZoomIn:h=Увеличить
ActionImageViewZoomOut:h=Уменьшить
ActionMenuEdit:h=Переключиться на вкладку 'Правка'
ActionMenuFile:h=Переключиться на вкладку 'Файл'
ActionMenuHelp:h=Переключиться на вкладку 'Справка'
ActionMenuSearch:h=Переключиться на вкладку 'Поиск'
ActionMenuTools:h=Переключиться на вкладку 'Инструменты'
ActionMenuView:h=Переключиться на вкладку 'Вид'
ActionOpenColorTheme:h=Открыть меню выбора обложек
ActionOpenColorTheme:s=Alt+F11
ActionOpenColorTheme=Обложка
ActionOpenEncoding:h=Открыть меню выбора кодировки
ActionOpenEncoding:s=Alt+F9
ActionOpenEncoding=Кодировка
ActionOpenFileList:h=Открыть меню выбора файлов
ActionOpenFileList:s=Alt+F12
ActionOpenFileList=Файлы
ActionOpenHighlighter:h=Открыть меню выбора стиля подсветки синтаксиса
ActionOpenHighlighter:s=Alt+F10
ActionOpenHighlighter=Стиль подсветки синтаксиса
ActionOutputClose=Закрыть
ActionOutputCloseActive:h=Закрыть текущую страницу
ActionOutputCloseActive=Включить
ActionOutputCloseAll:h=Закрыть все страницы
ActionOutputCloseAll=Все
ActionOutputCloseAllOtherPages:h=Закрыть все другие страницы
ActionOutputCloseAllOtherPages=Все другие страницы
ActionOutputCloseSelected:h=Закрыть выбор
ActionOutputCloseSelected=Выбор
ActionOutputCollapseAll:h=Свернуть все файлы
ActionOutputCollapseAll=Свернуть всё
ActionOutputCopyAllToClipboard:h=Копировать в буфер
ActionOutputCopyAllToClipboard=Копировать в буфер
ActionOutputCopySelectedToClipboard:h=Копировать выбор в буфер
ActionOutputCopySelectedToClipboard=Копировать выбор в буфер
ActionOutputExpandAll:h=Развернуть всё
ActionOutputExpandAll=Развернуть всё
ActionOutputOpenAll:h=Открыть все файлы
ActionOutputOpenAll=Открыть всё
ActionOutputOpenSelected:h=Открыть выбранные файлы
ActionOutputOpenSelected=Открыть выбранные
ActionOutputRefresh=Обновить
ActionOutputSelectAll:h=Выделить все файлы
ActionOutputSelectAll=Выделить всё
ActionOutputUnselectAll:h=Отменить выбор всех файлов
ActionOutputUnselectAll=Сбросить весь выбор
ActionPDFFindNext:h=Искать далее
ActionPDFFindPrevious:h=Искать назад
ActionPDFNextPage:h=Следущая страница
ActionPDFPreviousPage:h=Предыдущая страница
ActionPDFRotatePageClockwise:h=Повернуть страницу по часовой стрелке
ActionPDFRotatePageCounterClockwise:h=Повернуть страницу против часовой стрелки
ActionPDFSearchHighlightAll:t=Translation needed
ActionPDFSearchHighlightAll=Highlight all
ActionPDFSearchMatchCase=С учётом регистра
ActionPDFSearchWholeWords=Только слова целиком
ActionPDFZoomIn:h=Увеличить
ActionPDFZoomOut:h=Уменьшить
ActionSearch=Поиск
ActionSearchBookmarks:h=Show or refresh all saved bookmarks
ActionSearchBookmarks:t=Translation needed
ActionSearchBookmarks=Закладки
ActionSearchClearBookmarks:h=Удалить все закладки
ActionSearchClearBookmarks=Удалить закладки
ActionSearchClose:h=Закрыть
ActionSearchEngine:h=Выбрать движок поиска
ActionSearchEngine=Движок поиска
ActionSearchFindAll:h=Найти все совпадающие тексты
ActionSearchFindAll:s=Alt+Enter
ActionSearchFindAll=Найти все
ActionSearchFindDuplicates:h=Поиск дубликатов
ActionSearchFindDuplicates=Найти дубликаты
ActionSearchFindInFiles:h=Поиск строки в нескольких файлах
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=Поиск в файлах...
ActionSearchFindNext:h=Найти следующее соответствие текста
ActionSearchFindNext:s=F3
ActionSearchFindNext=Искать далее
ActionSearchFindPrevious:h=Найти предыдущее соответствие
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=Искать назад
ActionSearchGoToBookmarks:h=Перейти к закладкам
ActionSearchGoToBookmarks=К закладкам
ActionSearchGoToLine:h=Перейти к строке
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=К строке
ActionSearchInSelection:h=В выделении
ActionSearchInSelection=В выделении
ActionSearchMatchCase:h=С учётом регистра
ActionSearchMatchCase=С учётом регистра
ActionSearchOptions:h=Параметры поиска
ActionSearchReplace:h=Поиск и замена указанного текста
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=Замена...
ActionSearchSearchButton:h=Поиск указанного текста
ActionSearchSearchButton:s=Ctrl+F
ActionSearchSearchButton=Поиск...
ActionSearchSpellCheck:h=Проверка орфографии
ActionSearchSpellCheck:s=F6
ActionSearchSpellCheck=Орфография
ActionSearchSpellCheckNextError:h=Следующая ошибка орфографии
ActionSearchSpellCheckNextError:s=Ctrl+F6
ActionSearchSpellCheckNextError=Далее
ActionSearchSpellCheckPreviousError:h=Предыдущая ошибка орфографии
ActionSearchSpellCheckPreviousError:s=Ctrl+Shift+F6
ActionSearchSpellCheckPreviousError=Назад
ActionSearchTextItems:h=Элементы поиска
ActionSearchTextItems=Элементы поиска...
ActionSearchToggleBookmark:h=Установить/снять закладку активной строки. Кроме того, закладки можно установить нажатием Ctrl+Shift+1..9. Перейти к закладке можно нажатием Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=Сделать закладку
ActionSearchToggleBookmarks:h=Установить закладки
ActionSearchToggleBookmarks=Закладки
ActionSearchWholeWords:h=Только слова целиком
ActionSearchWholeWords=Только слова целиком
ActionStatusBarShowCaretPosition=Показать позицию знака вставки
ActionStatusBarShowCharacterCount=Показать количество символов
ActionStatusBarShowEditorZoom=Показать масштаб редактора
ActionStatusBarShowEncoding=Показать кодировку
ActionStatusBarShowFileLineBreak:t=Translation needed
ActionStatusBarShowFileLineBreak=Show file line break
ActionStatusBarShowFileOpeningTime=Показать время открытия файла
ActionStatusBarShowHints=Показать подсказки
ActionStatusBarShowKeyState=Показать режим вставки/перезаписи
ActionStatusBarShowLineCount:t=Translation needed
ActionStatusBarShowLineCount=Show line count
ActionStatusBarShowMacro=Показать макрос
ActionStatusBarShowModified=Показать изменённые
ActionStatusBarShowSelectionInfo=Показать информацию о выборе
ActionStatusBarShowSizeGrip=Показать размер фрагмента
ActionToolbarMenuLanguage=Язык
ActionToolbarMenuLayout=Макет
ActionToolbarMenuLayoutSingle=Одна колонка
ActionToolbarMenuLayoutThreeColumns=Три колонки
ActionToolbarMenuLayoutTwoColumns=Две колонки
ActionToolbarMenuView=Вид
ActionTools=Инструменты
ActionToolsCharacterMap:h=Вставка символов в активный документ двойным кликом
ActionToolsCharacterMap=Таблица символов...
ActionToolsClipboardHistory:h=История буфера обмена
ActionToolsClipboardHistory=История буфера
ActionToolsConvert:h=Преобразование между числовыми единицами измерения
ActionToolsConvert=Конвертация...
ActionToolsExecute:h=Запуск приложений пользователя
ActionToolsExecute=Выполнить
ActionToolsExecuteConfigure:h=Настройка свойств выполнения
ActionToolsExecuteConfigure=Конфигурация...
ActionToolsLanguageEditor:h=Редактор перевода файлов локализации
ActionToolsLanguageEditor=Редактор языковых файлов...
ActionToolsMacro=Макросы
ActionToolsMacroOpen:h=Открыть существующий макрос
ActionToolsMacroOpen=Открыть...
ActionToolsMacroPause:h=Пауза макроса
ActionToolsMacroPause:s=Shift+Ctrl+R
ActionToolsMacroPause=Пауза
ActionToolsMacroPlayback:h=Запуск макроса
ActionToolsMacroPlayback:s=Shift+Ctrl+P
ActionToolsMacroPlayback=Воспроизведение
ActionToolsMacroRecord:h=Запись макроса
ActionToolsMacroRecord:s=Shift+Ctrl+R
ActionToolsMacroRecord=Запись
ActionToolsMacroSaveAs:h=Сохраните макрос с новым именем
ActionToolsMacroSaveAs=Сохранить как...
ActionToolsMacroStop:h=Остановить запись макроса
ActionToolsMacroStop:s=Shift+Ctrl+S
ActionToolsMacroStop=Стоп
ActionToolsMagnifier:h=Лупа
ActionToolsMagnifier=Лупа
ActionToolsMagnifierBorderStyle:h=Стиль рамки лупы
ActionToolsMagnifierBorderStyle=Стиль рамки
ActionToolsMagnifierBorderStyleDefault:h=Стиль рамки лупы по умолчанию
ActionToolsMagnifierBorderStyleDefault=По умолчанию
ActionToolsMagnifierBorderStyleFlat:h=Плоский стиль рамки лупы
ActionToolsMagnifierBorderStyleFlat=Плоская
ActionToolsMagnifierBorderStyleNone:h=Без рамки
ActionToolsMagnifierBorderStyleNone=Нет
ActionToolsMagnifierClose:h=Закрыть лупу
ActionToolsMagnifierClose:s=Ctrl+Esc
ActionToolsMagnifierClose=Закрыть
ActionToolsMagnifierScaling16x:h=16-ти кратное увеличение
ActionToolsMagnifierScaling16x=16x
ActionToolsMagnifierScaling2x:h=2-х кратное увеличение
ActionToolsMagnifierScaling2x=2x
ActionToolsMagnifierScaling4x:h=4-х кратное увеличение
ActionToolsMagnifierScaling4x=4x
ActionToolsMagnifierScaling8x:h=8-ми кратное увеличение
ActionToolsMagnifierScaling8x=8x
ActionToolsMagnifierScaling:h=Масштаб
ActionToolsMagnifierScaling=Масштаб
ActionToolsMagnifierStyle:h=Стиль
ActionToolsMagnifierStyle=Стиль
ActionToolsMagnifierStyleLens:h=Стиль 'объектив'
ActionToolsMagnifierStyleLens=Объектив
ActionToolsMagnifierStyleRectangle:h=Стиль 'прямоугольник'
ActionToolsMagnifierStyleRectangle=Прямоугольник
ActionToolsOptions:h=Настройка параметров программы
ActionToolsOptions=Настройки...
ActionToolsPauseSpeaking:h=Приостановить озвучивание
ActionToolsPauseSpeaking=Пауза озвучивания
ActionToolsSelectForTextCompare:h=Выбор документа для сравнения
ActionToolsSelectForTextCompare=Выбрать для сравнения...
ActionToolsSpeech=Озвучивание
ActionToolsStartSpeaking:h=Начать озвучивание
ActionToolsStartSpeaking=Пуск озвучивания
ActionToolsStopSpeaking:h=Остановить озвучивание
ActionToolsStopSpeaking=Стоп озвучивания
ActionToolsTextCompare:h=Сравнение файлов
ActionToolsTextCompare=Сравнить файлы...
ActionView=Вид
ActionViewBookmarkList:h=Show or hide the bookmark list
ActionViewBookmarkList:t=Translation needed
ActionViewBookmarkList=Bookmark list
ActionViewColorThemeSelection:h=Показать/скрыть выбор цвета
ActionViewColorThemeSelection=Цвет
ActionViewDirectory=Каталог
ActionViewDirectoryClose:h=Закрыть активный каталог
ActionViewDirectoryClose:s=Shift+Alt+X
ActionViewDirectoryClose=Закрыть каталог
ActionViewDirectoryEdit:h=Редактировать активный каталог
ActionViewDirectoryEdit:s=Shift+Ctrl+E
ActionViewDirectoryEdit=Редактировать каталог...
ActionViewDirectoryOpen:h=Открыть новый каталог
ActionViewDirectoryOpen:s=Ctrl+Alt+D
ActionViewDirectoryOpen=Открыть каталог...
ActionViewDirectoryVisibility:h=Показать/скрыть каталог
ActionViewDirectoryVisibility=Каталог
ActionViewEncodingSelection:h=Показать/скрыть выбор кодировки
ActionViewEncodingSelection=Кодировка
ActionViewFiles:h=Поиск файлов выбранного каталога
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=Файлы...
ActionViewFolding=Свёртка
ActionViewFoldingCollapse=Свернуть
ActionViewFoldingCollapseAll:h=Свернуть всё
ActionViewFoldingCollapseAll=Свернуть всё
ActionViewFoldingCollapseAllDownFromActiveLine:h=Свернуть всё вниз от активной строки
ActionViewFoldingCollapseAllDownFromActiveLine=Свернуть всё вниз от активной строки
ActionViewFoldingCollapseAllUpFromActiveLine:h=Свернуть всё вверх от активной строки
ActionViewFoldingCollapseAllUpFromActiveLine=Свернуть всё вверх от активной строки
ActionViewFoldingCollapseLine:h=Свернуть линию
ActionViewFoldingCollapseLine:s=Ctrl+Alt+Left
ActionViewFoldingCollapseLine=Свернуть линию
ActionViewFoldingExpand=Развернуть
ActionViewFoldingExpandAll:h=Развернуть всё
ActionViewFoldingExpandAll=Развернуть всё
ActionViewFoldingExpandAllDownFromActiveLine:h=Развернуть всё вниз от активной строки
ActionViewFoldingExpandAllDownFromActiveLine=Развернуть всё вниз от активной строки
ActionViewFoldingExpandAllUpFromActiveLine:h=Развернуть всё вверх от активной строки
ActionViewFoldingExpandAllUpFromActiveLine=Развернуть всё вверх от активной строки
ActionViewFoldingExpandLine:h=Развернуть строку
ActionViewFoldingExpandLine:s=Ctrl+Alt+Right
ActionViewFoldingExpandLine=Развернуть строку
ActionViewFoldingNext:h=Перейти к следующей свёртке
ActionViewFoldingNext:s=Ctrl+Alt+Down
ActionViewFoldingNext=Далее
ActionViewFoldingPrevious:h=Перейти к предыдущей свёртке
ActionViewFoldingPrevious:s=Ctrl+Alt+Up
ActionViewFoldingPrevious=Назад
ActionViewFullScreen:h=Развернуть окно редактора во весь экран или свернуть до исходных размеров
ActionViewFullScreen:s=F11
ActionViewFullScreen=Полный экран
ActionViewHexEditor:h=Показать/скрыть HEX-редактор
ActionViewHexEditor:s=Ctrl+H
ActionViewHexEditor=HEX-редактор
ActionViewHighlighterSelection:h=Показать/скрыть выбор подсветки синтаксиса
ActionViewHighlighterSelection=Маркер
ActionViewLineNumbers:h=Показать/скрыть номера строк
ActionViewLineNumbers=Номера строк
ActionViewMainMenu:h=Показать/скрыть главное меню
ActionViewMainMenu=Главное меню
ActionViewMenuBar:h=Показать/скрыть строку меню
ActionViewMenuBar=Лента меню
ActionViewMiniMap:h=Показать/скрыть миникарту
ActionViewMiniMap=Миникарта
ActionViewNextPage:h=Перейти на следующую страницу
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=Вперёд
ActionViewOutput:h=Показать/скрыть вывод
ActionViewOutput=Вывод
ActionViewPreviousPage:h=Перейти на предыдущую страницу
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=Назад
ActionViewRuler:h=Показать/скрыть линейку
ActionViewRuler=Линейка
ActionViewSelectionMode:h=Переключение в режим выбора строки или колонки. Кроме того, эти режимы переключаются нажатием клавиши Alt.
ActionViewSelectionMode=Выбор
ActionViewSFTP=SFTP
ActionViewSFTPConnect=Соединить
ActionViewSFTPDisconnect=Отсоединить
ActionViewSFTPEdit=Правка
ActionViewSkinSelector=Выбор обложек
ActionViewSpecialChars:h=Показать/скрыть специальные символы
ActionViewSpecialChars=Специальные символы
ActionViewSplit:h=Разделить документ
ActionViewSplit=Разделить
ActionViewSplitHorizontal:h=Разделение по горизонтали
ActionViewSplitHorizontal=По горизонтали
ActionViewSplitVertical:h=Разделение по вертикали
ActionViewSplitVertical=По вертикали
ActionViewStatusBar:h=Показать/скрыть строку состояния
ActionViewStatusBar=Строка состояния
ActionViewSyncEdit:h=Показать/скрыть синхронную обработку
ActionViewSyncEdit:s=Shift+Ctrl+H
ActionViewSyncEdit=Синхронизация
ActionViewTitleBar=Строка заголовка
ActionViewTitleBarApplicationName:h=Показать или скрыть имя приложения в строке заголовка
ActionViewTitleBarApplicationName=Имя приложения
ActionViewTitleBarFavourite:h=Показать/скрыть в строке заголовка избранное
ActionViewTitleBarFavourite=Избранное
ActionViewTitleBarFileList:h=Показать/скрыть в строке заголовка список файлов
ActionViewTitleBarFileList=Список файлов
ActionViewTitleBarFilename:h=Показать/скрыть в строке заголовка имя файла
ActionViewTitleBarFilename=Имя файла
ActionViewTitleBarMagnifier:h=Показать/скрыть в строке заголовка лупу
ActionViewTitleBarMagnifier=Лупа
ActionViewToolbar:h=Показать/скрытьь панель инструментов
ActionViewToolbar=Панель инструментов
ActionViewWordWrap:h=Вкл/выкл перенос слов
ActionViewWordWrap=Перенос слов
ActionViewXMLTree:h=Показать/скрыть XML-дерево
ActionViewXMLTree=XML-дерево
ActionViewZoomEditorIn:h=Редактор - масштаб +
ActionViewZoomEditorIn=Увеличить
ActionViewZoomEditorOut:h=Редактор - масштаб -
ActionViewZoomEditorOut=Уменьшить
ActionViewZoomEditorReset:h=Сбросить масштаб редактора
ActionViewZoomEditorReset=Сбросить масштаб
ActionXMLTreeRefresh:h=Обновить XML-дерево
ActionXMLTreeRefresh=Обновить

[Message]
CannotFindString=Строка "%s" не найдена
DuplicatesWereNotFound=Дубликаты не найдены
InstallNewVersion=Установить нвую версию программы?
LatestVersion=Вы используете последнюю версию.
NoDefaultPrinter=Не выбран принтер по умолчанию.
PdfErrorPassword=Требуется пароль или неверный пароль .
ScaleChange=Для корректного масштабирования необходимо перезапустить приложение.
SelectFilePathFromDirectory=Выберите путь к файлу из каталога

[OptionsApplicationFrame]
CheckBoxAddApplicationInOpentWithContextMenu=Добавить приложение в контекстное меню 'Открыть с помощью'
CheckBoxAllowExitWithEsc=Разрешить выход с помощью ESC
CheckBoxAllowMultipleInstances=Разрешить несколько экземпляров
CheckBoxCloseMinimizes=Сворачивать вместо закрытия
CheckBoxDropFiles=Перетаскивание файлов
CheckBoxHotExit:h=Закрывать без запроса на сохранение файлов. Файлы будут сохранены и восстановлены.
CheckBoxHotExit=Быстрый выход
CheckBoxMinimizeToSystemTray=Сворачивать в системный трей
CheckBoxStayOnTop=Поверх всех окон
CheckBoxUseLatestCommonDialogs=Cовременные окна диалога
CheckBoxUseReverseUTF8Naming:t=Translation needed
CheckBoxUseReverseUTF8Naming=Use reverse UTF-8 encoding naming
ComboBoxLanguage=Язык
SpinEditReopenMaxFileCount:t=Translation needed
SpinEditReopenMaxFileCount=Reopen max file count
SpinEditSplitterSize=Размер разделителя

[OptionsApplicationScalingFrame]
RadioButtonAuto=Автоматически
RadioButtonPercent=В процентах
RadioButtonPixelsPerInch=В пикселях на дюйм

[OptionsApplicationUpdatesFrame]
CheckBoxCheckForUpdatesAtStartup=Проверять наличие обновлений при запуске
CheckBoxCheckForUpdatesWhenClosing=Проверять наличие обновлений при закрытии

[OptionsApplicationClipboardHistoryFrame]
CheckBoxClipboardHistoryEnabled=Включить
SpinEditClipboardHistoryItemsCount=Число элементов

[OptionsApplicationModifiedFilesFrame]
CheckBoxAskToReloadModifiedFiles=Запрос об обновлении файлов
CheckBoxMoveCaretAtTheEnd=После перезагрузки перемещать знак вставки в конец файла
CheckBoxPollFileChanges:t=Translation needed
CheckBoxPollFileChanges=Poll file changes
CheckBoxReloadAutomaticallyModifiedFiles=Обновлять автоматически
SpinEditPollingInterval:t=Translation needed
SpinEditPollingInterval=Polling interval (ms)

[OptionsDirectoryFrame]
CheckBoxAutoHide=Скрывать автоматически
CheckBoxAutoSelect:t=Translation needed
CheckBoxAutoSelect=Auto select
CheckBoxUseSelectedPathAsDefaultDirectory=Выбрать путь, как папка по умолчанию
CheckBoxShowArchiveFiles=Показать архивы
CheckBoxShowHiddenFiles=Показать скрытые файлы
CheckBoxShowOverlayIcons=Показать значки наложения
CheckBoxShowSystemFiles=Показать системные файлы
CheckBoxShowTreeLines=Показать дерево строк
CheckBoxUseExplorerTheme=Тема проводника
ComboBoxAlign=Выравнивание
SpinEditIndent=Отступ
SpinEditMargin=Поле

[OptionsDirectoryTabsFrame]
CheckBoxBoldActiveTab=Активная вкладка жирным шрифтом
CheckBoxCloseTabByDblClick=Закрыть вкладку двойным кликом
CheckBoxCloseTabByMiddleClick=Закрыть вкладку средним кликом
CheckBoxEnlargeActiveTab=Увеличить активную вкладку
CheckBoxMultiline=Многострочная
CheckBoxRightClickSelect=Выбор правой кнопкой
CheckBoxSaveTabs=Сохранить вкладки
CheckBoxShowIcon=Показать изображения
CheckBoxShowOpenDirectoryButton=Показать кнопку 'Открыть папку'
ComboBoxShowCloseButton=Показать кнопку 'Закрыть'
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontSizeCustom=Настроить
RadioButtonFontSizeDefault=По умолчанию
SpinEditTabHeight=Высота
SpinEditTabMargin=Поле
SpinEditTabSpacing=Интервал

[OptionsEditorBackupFrame]
CheckBoxActive=Включить
EditFileExtension=Расширение файла
GroupBoxPath=Путь
GroupBoxSuffix=Окончание
RadioButtonPathCustom=Задать
RadioButtonPathFile=Файл
RadioButtonSuffixCounter=Счётчик
RadioButtonSuffixDateAndTime=Дата и время
RadioButtonSuffixNone=Нет

[OptionsEditorBookmarkListFrame]
CheckBoxShowFilters:t=Translation needed
CheckBoxShowFilters=Show filters
CheckBoxShowLineNumbers:t=Translation needed
CheckBoxShowLineNumbers=Show line numbers
CheckBoxTrimText:t=Translation needed
CheckBoxTrimText=Trim text
CheckBoxUpdateForAllBookmarkLists:t=Translation needed
CheckBoxUpdateForAllBookmarkLists=Update for all bookmark lists
CheckBoxUpdateWidthWhenResized:t=Translation needed
CheckBoxUpdateWidthWhenResized=Update width when resized
CheckBoxVisible:t=Translation needed
CheckBoxVisible=Visible
ComboBoxAlign:t=Translation needed
ComboBoxAlign=Align
GroupBoxSortBy:t=Translation needed
GroupBoxSortBy=Sort by
RadioButtonSortByColor:t=Translation needed
RadioButtonSortByColor=Color
RadioButtonSortByLineNumber:t=Translation needed
RadioButtonSortByLineNumber=Line number
RadioButtonSortByText:t=Translation needed
RadioButtonSortByText=Text
SpinEditWidth=Ширина

[OptionsEditorCaretFrame]
CheckBoxMultipleCaretsActive=Включить
CheckBoxMultipleCaretsShowActiveLine=Показать активную строку
CheckBoxMultipleCaretsShowGhost=Показать тень
CheckBoxNonblinkingCaretActive=Включить
CheckBoxRightMouseClickMovesCaret=Переместить знак вставки кликом правой кнопкой мыши
CheckBoxVisible=Показать
ColorComboBoxNonblinkingCaretBackground=Цвет заднего плана
ColorComboBoxNonblinkingCaretForeground=Цвет переднего плана
ComboBoxStylesInsertCaret=Вставка
ComboBoxStylesOverwriteCaret=Перезапись
GroupBoxMultipleCarets=Несколько знаков вставки
GroupBoxNonBlinkingCaret=Немигающий знак вставки
GroupBoxStyles=Стили

[OptionsEditorColorFrame]
ActionReset=Сброс
CheckBoxElementsAttributesBold=Жирный
CheckBoxElementsAttributesItalic=Курсив
CheckBoxElementsAttributesUnderline=Подчёркнутый
CheckBoxSkinActiveLineBackground=Фон активной строки
CheckBoxSkinBackground=Фон
CheckBoxSkinBookmarkPanelBackground=Фон панели закладок
CheckBoxSkinCodeFoldingBackground=Фон свёртки кода
CheckBoxSkinCodeFoldingHintBackground=Фон подсказки свёртки кода
CheckBoxSkinCompletionProposalBackground=Фон предложения завершения
CheckBoxSkinCompletionProposalSelectionBackground=Фон выбора предложения завершения
CheckBoxSkinForeground=Основной цвет
CheckBoxSkinLeftMarginBackground=Фон левого поля
CheckBoxSkinSelectionBackground=Задний план выбора
CheckBoxSkinSelectionForeground=Передний план выбора
ColorComboBoxEditorColor=Цвет
ColorComboBoxElementsBackground=Фон
ColorComboBoxElementsForeground=Основной цвет
ComboBoxColorTheme=Цвет
ComboBoxEditorElement=Элемент
ComboBoxElementsName=Имя
ComboBoxHighlighter=Подсветка синтаксиса
DateEditDate=Дата
EditEmail=Email
EditName=Имя
EditVersion=Версия
GroupBoxAttributes=Атрибуты
LabelSkinDescription=Использовать цвет обложки для выбранных элементов
TabSheetAuthor=Автор
TabSheetEditor=Редактор
TabSheetElements=Элементы
TabSheetGeneral=Общие
TabSheetUseSkinColor=Цвет обложки

[OptionsEditorCompletionProposalFrame]
CheckBoxActive=Включить
CheckBoxAddHighlighterKeywords=Добавить ключевые слова подсветки синтаксиса
CheckBoxAutoInvoke=Вызов автоматически
CheckBoxMatchCase=С учётом регистра
CheckBoxParseWordsFromText=Разобрать слова из текста
CheckBoxShowSnippets=Показать фрагменты кода
ComboBoxKeywordCase=Регистр ключевых слов
ComboBoxShortcut=Кратчайший путь
SpinEditNumberOfRows=Количество строк

[OptionsEditorCompletionProposalSnippetsFrame]
ActionAdd:h=Добавить фрагмент
ActionAdd=Добавить
ActionClone:h=Clone snippet
ActionClone:t=Translation needed
ActionClone=Clone
ActionDelete:h=Удалить выделенный фрагмент
ActionDelete=Удалить
ActionEdit:h=Правка фрагмента
ActionEdit=Правка
VirtualDrawTree:0=Фрагмент
VirtualDrawTree:1=Описание

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=Цветовая тема
ComboBoxDefaultEncoding=Кодировка
ComboBoxDefaultHighlighter=Подсветка
ComboBoxDefaultSQLHighlighter=Подсветка SQL
EditBrowser=Браузер
GroupBoxDirectory=Папка
RadioButtonCurrentWindowsDirectory=Текущая папка
RadioButtonCustomDirectory=Папка пользователя
RadioButtonLatestDirectory=Последняя папка

[SnippetEditDialog]
CheckBoxCursorPositionActive=Включить
CheckBoxSelectionActive=Включить
ComboBoxExecuteWith=Выполнить с
ComboBoxGroupName=Имя группы
ComboBoxHighlighter=Подсветка синтаксиса
ComboBoxShortcut=Ярлык
EditDescription=Описание
EditKeyword=Ключевое слово
GroupBoxCursorPosition=Позиция курсора
GroupBoxSelection=Выбор
SpinEditCursorPositionColumn=Колонка
SpinEditCursorPositionRow=Строка
SpinEditSelectionFromColumn=Из колонки
SpinEditSelectionFromRow=Из строки
SpinEditSelectionToColumn=В колонку
SpinEditSelectionToRow=В строку
TextEditor=Фрагменты кода

[OptionsEditorFoldingFrame]
CheckBoxExpandByHintClick=Развернуть кликом по подсказке
CheckBoxFoldMultilineComments=Свернуть многострочные комментарии
CheckBoxHighlightIndentGuides=Выделить направляющие отступа
CheckBoxHighlightMatchingPair=Выделить пару совпадений
CheckBoxShowCollapsedCodeHint=Показать подсказку свёртки кода
CheckBoxShowCollapsedLine=Показать свёрнутую строку
CheckBoxShowCollapseMarkAtTheEnd=Показать маркер свёртки в конце
CheckBoxShowIndentGuides=Показать направляющие отступа
CheckBoxShowTreeLine=Показать древовидную структуру
CheckBoxTextFoldingActive=Включить
CheckBoxVisible=Показать
ComboBoxGuideLineStyle=Стиль направляющей линии
ComboBoxMarkStyle=Стиль маркера
GroupBoxCodeFolding=Свёртка кода
GroupBoxTextFolding=Свёртка текста
RadioButtonOutlinedByACharacter=Обрамлены символом
RadioButtonOutlinedBySpacesAndTabs=Обрамлены пробелами и табуляциями
SpinEditCollapsedRowCharacterCount=Количество символов в свёрнутой строке
SpinEditDelayInterval=Интервал задержки (мс)
SpinEditHintRowCount=Количество строк подсказки

[OptionsEditorFontFrame]
ActionReset=Сброс
CheckBoxUseSameSettingsForAllColorThemes:t=Translation needed
CheckBoxUseSameSettingsForAllColorThemes=Use same settings for all color themes
ComboBoxColorTheme=Цвет
ComboBoxElement=Элемент
FontComboBoxFont=Шрифт
SpinEditFontSize=Размер шрифта

[OptionsEditorLeftMarginFrame]
CheckBoxAutoSize=Размер автоматически
CheckBoxLineStateShowOnlyModified:t=Translation needed
CheckBoxLineStateShowOnlyModified=Show only modified
CheckBoxLineStateVisible=Показать
CheckBoxVisible=Показать
ComboBoxLineStateAlign=Выравнивание
GroupBoxLineState:t=Translation needed
GroupBoxLineState=Line state
SpinEditWidth=Ширина

[OptionsEditorLeftMarginBookmarksFrame]
CheckBoxSaveBookmarks:t=Translation needed
CheckBoxSaveBookmarks=Save bookmarks
CheckBoxShowBookmarkColorsPopup:t=Translation needed
CheckBoxShowBookmarkColorsPopup=Show bookmark colors popup
CheckBoxShowPanel=Показать панель закладок
CheckBoxVisible=Показать
ColorComboBoxLineColor=Цвет строк закладок
SpinEditPanelWidth=Ширина панели закладок

[OptionsEditorLeftMarginLineNumbersFrame]
CheckBoxShowAfterLastLine=Показать номера строк после последней строки
CheckBoxShowInTens=Номера строк в десятках
CheckBoxShowLeadingZeros=Номера строк начиная с нуля
CheckBoxVisible=Показать
SpinEditStartFrom=Начать со строки

[OptionsEditorMatchingPairFrame]
CheckBoxAutoComplete=Заполнение автоматически
CheckBoxHighlightActive=Включить
CheckBoxHighlightAfterToken=Выделить после маркера
CheckBoxHighlightUnmatched=Выделить уникальные
GroupBoxDisplay=Отображение
GroupBoxHighlight=Выделение
RadioButtonHighlight=Выделить
RadioButtonUnderline=Подчеркнуть

[OptionsEditorMinimapFrame]
CheckBoxBlendingEnabled=Включить
CheckBoxBlendingInvert=Инвертировать
CheckBoxShowBookmarks=Показать закладки
CheckBoxShowBorder=Показать рамку
CheckBoxShowIndentGuides=Показать направляющую отступа
CheckBoxShowSearchResults=Показать результаты поиска
CheckBoxShowSelection=Показать выбор
CheckBoxShowShadow=Показать тень
CheckBoxVisible=Показать
ComboBoxAlign=Выравнивание
GroupBoxBlending=Смешивание
SpinEditWidth=Ширина

[OptionsEditorOptionsFrame]
CheckBoxAutoChangeEncoding:t=Translation needed
CheckBoxAutoChangeEncoding=Auto change encoding when saved
CheckBoxAutoIndent=Абзацы автоматически
CheckBoxAutoSave=Сохранение автоматически
CheckBoxDragDropEditing=Редактирование перетаскиванием
CheckBoxGroupUndo=Групповая отмена
CheckBoxSaveUnmodified=Сохранить без изменений
CheckBoxShowControlCharacters=Показать управляющие символы
CheckBoxShowNonBreakingSpaceAsSpace=Показать неразрывный пробел как пробел
CheckBoxShowNullCharacters=Показать нулевые символы
CheckBoxShowWarningBeforeSaving:t=Translation needed
CheckBoxShowWarningBeforeSaving=Show warning before saving
CheckBoxShowZeroWidthSpaceCharacters=Показывать символы пробела нулевой ширины
CheckBoxTrailingLineBreak=Разрыв строки после последней строки
CheckBoxTrimTrailingSpaces=Удаление пробелов в конце строки
CheckBoxUndoAfterSave=Отмена после сохранения
ComboBoxDefaultLineBreak=Разрыв строки по умолчанию
GroupBoxInternationalCharacters:t=Translation needed
GroupBoxInternationalCharacters=International characters with ASCII/ANSI encoding 
SpinEditBorderWidth=Ширина границы
SpinEditLineSpacing=Расстояние между строками
SpinEditMargin=Отступ

[OptionsEditorRightMarginFrame]
CheckBoxAutoLineBreak=Разрыв строки автоматически
CheckBoxMouseMove=Движение мыши
CheckBoxShowMovingHint=Показать индикацию позиции
CheckBoxVisible=Показать
SpinEditPosition=Позиция

[OptionsEditorRulerFrame]
CheckBoxShowSelection=Показать выбор
CheckBoxVisible=Показать
SpinEditHeight=Высота

[OptionsEditorScrollFrame]
CheckBoxAutosizeMaxWidth=Максимальная ширина автоматически
CheckBoxHalfPage=Половина страницы
CheckBoxHintFollows=Следующая подсказка
CheckBoxPastEndOfFile=Прокрутить до конца файла
CheckBoxPastEndOfLineMarker=Прокрутить до конца строки
CheckBoxShowHint=Показать подсказку
CheckBoxShowHorizontalScrollBar=Показать горизонтальную полосу прокрутки
CheckBoxShowShadow=Показать тень
CheckBoxShowVerticalScrollBar=Показать вертикальную полосу прокрутки

[OptionsEditorSearchFrame]
CheckBoxAutoCompleteEnabled=Включить
CheckBoxBeepIfSearchStringNotFound=Звуковой сигнал, если строка поиска не найдена
CheckBoxClearWhenClosed=Очистить при закрытии
CheckBoxEntireScope=Весь объём
CheckBoxFileSpecificSearch=Поиск по файлу
CheckBoxFindWordAtCursor=Найти слово под курсором
CheckBoxHighlightResult=Выделить результаты
CheckBoxMatchCase=С учётом регистра
CheckBoxNearOperatorEnabled=Включить
CheckBoxSearchOnTyping=Поиск при наборе текста
CheckBoxSearchOnTypingEnabled=Включить
CheckBoxSetFocusIntoEditorWithEnter=Установить фокус в редакторе клавишей Enter
CheckBoxShowSearchMap=Показать карту поиска
CheckBoxShowSearchMatchNotFound=Показать 'Соответствие поиска не найдено'
CheckBoxShowSearchStringNotFound=Показать сообщение, что строка поиска не найдена
CheckBoxToggleSearchBar=Показать/скрыть панель поиска
CheckBoxUseUpAndDownArrowKeysToFind:t=Translation needed
CheckBoxUseUpAndDownArrowKeysToFind=Use up and down arrow keys to find
CheckBoxVisible=Показать
CheckBoxWholeWords=Только слова целиком
CheckBoxWrapAround=Начать заново, если не найдено
ComboBoxSearchBarAlign=Выровнять панель поиска
ComboBoxSearchMapAlign=Выровнять карту поиска
GroupBoxAutoComplete=Заполнение автоматически
GroupBoxNearOperator:h=Syntax: Word1 NEAR Word2 or Word1 NEAR:d Word2, where d is the maximum distance of words.
GroupBoxNearOperator:t=Translation needed
GroupBoxNearOperator=NEAR operator
GroupBoxSearchOnTyping=Поиск при наборе текста
SpinEditAutoCompleteDelayInterval=Интервал задержки (мс)
SpinEditNearOperatorMaximumDistance:t=Translation needed
SpinEditNearOperatorMaximumDistance=Maximum distance
SpinEditNearOperatorMinimumDistance:t=Translation needed
SpinEditNearOperatorMinimumDistance=Minimum distance
SpinEditSearchOnTypingDelayInterval=Интервал задержки (мс)

[OptionsEditorSelectionFrame]
CheckBoxALTSetsColumnMode=Задать режим колонки клавишей ALT
CheckBoxAutoCopyToClipboard=Копировать в буфер обмена автоматически
CheckBoxExpandPrefixCharacters=Развернуть символы префикса
CheckBoxExpandRealNumbers=Раскрыть вещественные числа
CheckBoxFromEndOfLine=С конца строки
CheckBoxHighlightSimilarTerms=Выделить похожие термины
CheckBoxTermsMatchCase=Термины чувствительны к регистру
CheckBoxToEndOfLastLine=До конца последней строки
CheckBoxToEndOfLine=До конца строки
CheckBoxTripleClickRowSelect=Выбор строки тройным кликом
CheckBoxVisible=Показать

[OptionsEditorSortFrame]
CheckBoxCaseSensitive:t=Translation needed
CheckBoxCaseSensitive=Case sensitive
CheckBoxNaturalSortOrder:t=Translation needed
CheckBoxNaturalSortOrder=Natural sort order

[OptionsEditorSpecialCharsFrame]
CheckBoxLineBreakVisible=Показать
CheckBoxSelectionVisible=Показать
CheckBoxVisible=Показать
ColorComboBoxLineBreakColor=Цвет
ColorComboBoxSelectionColor=Цвет
ComboBoxArrowStyle=Стиль
ComboBoxLineBreakStyle=Стиль
GroupBoxColor=Цвет
GroupBoxLineBreak=Конец строки
GroupBoxSelection=Выбор
RadioButtonCustomColor=Использовать цвет
RadioButtonMiddleColor=Использовать средний цвет
RadioButtonTextColor=Использовать цвет текста

[OptionsEditorSpellCheckFrame]
CheckBoxActive=Включить
ColorComboBoxUnderlineColor=Цвет
ComboBoxDictionary=Словарь
ComboBoxUnderlineType=Тип
GroupBoxUnderline=Подчеркнуть

[OptionsEditorSyncEditFrame]
CheckBoxActive=Включить
CheckBoxMatchCase=С учётом регистра
CheckBoxShowActivateIcon=Показать значок активации

[OptionsEditorTabsFrame]
CheckBoxBoldActiveTab=Жирный шрифт активной вкладки
CheckBoxCloseTabByDblClick=Закрывать вкладку двойным кликом
CheckBoxCloseTabByMiddleClick=Закрывать вкладку средним кликом
CheckBoxDimReadOnlyWhenNotActive=Затемнить 'Только для чтения', если неактивно
CheckBoxEnlargeActiveTab=Увеличить активную вкладку
CheckBoxHideCloseButtonWhenCanCloseIsNotChecked=Скрыть кнопку 'Закрыть', если не отмечено 'Можно закрыть'
CheckBoxMultiline=Многострочная
CheckBoxRightClickSelect=Выбор правым кликом
CheckBoxSaveTabs=Сохранить вкладки
CheckBoxShowFileNameAsHint=Показать имя файла как подсказка
CheckBoxShowIcon=Показать изображения
CheckBoxShowNewFileButton=Показать кнопку 'Новый файл'
ComboBoxShowCloseButton=Показать кнопку 'Закрыть'
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontSizeCustom=Задать
RadioButtonFontSizeDefault=По умолчанию
SpinEditTabHeight=Высота
SpinEditTabMargin=Поле
SpinEditTabSpacing=Интервал

[OptionsEditorTabulatorFrame]
CheckBoxColumns=Колонки
CheckBoxPreviousLineIndent=Отступ предыдущей строки
CheckBoxSelectedBlockIndent=Отступ выделенного блока
CheckBoxTabsToSpaces=Табуляции в пробелы
SpinEditWidth=Ширина

[OptionsEditorWordWrapFrame]
CheckBoxActive=Включить
ComboBoxWidth=Ширина

[OptionsEditorXMLTreeFrame]
CheckBoxUseExplorerTheme=Использовать тему проводника
CheckBoxVisible=Показать
ComboBoxAlign=Выравнивание
SpinEditWidth=Ширина

[OptionsFileTypesFrame]
EditExtensions=Расширения
VirtualDrawTree:0=Тип файла

[OptionsForm]
ActionApplication=Приложение
ActionApplicationClipboardHistory=История буфера обмена
ActionApplicationModifiedFiles=Изменённые файлы
ActionApplicationScaling=Масштабирование
ActionApplicationUpdates=Обновления
ActionCompare=Сравнение файлов
ActionDirectory=Каталог
ActionDirectoryTabs=Вкладки
ActionEditor=Редактор
ActionEditorBackup=Резервная копия
ActionEditorBookmarkList:t=Translation needed
ActionEditorBookmarkList=Bookmark list
ActionEditorCaret=Знак вставки
ActionEditorColors=Цвета
ActionEditorCompletionProposal=Автозаполнение
ActionEditorCompletionProposalSnippets=Фрагменты кода
ActionEditorDefaults=Умолчания
ActionEditorFolding=Свёртка кода
ActionEditorFonts=Шрифт
ActionEditorLeftMargin=Левая граница
ActionEditorLeftMarginBookmarks=Закладки
ActionEditorLeftMarginLineNumbers=Номера строк
ActionEditorMatchingPair=Пары совпадений
ActionEditorMinimap=Миникарта
ActionEditorRightMargin=Правая граница
ActionEditorRuler=Линейка
ActionEditorScroll=Прокрутка
ActionEditorSearch=Поиск
ActionEditorSelection=Выделение
ActionEditorSort:t=Translation needed
ActionEditorSort=Sort
ActionEditorSpecialChars=Специальные символы
ActionEditorSpellCheck=Орфография
ActionEditorSyncEdit=Синхронизация
ActionEditorTabs=Вкладки
ActionEditorTabulator=Табулятор
ActionEditorWordWrap=Перенос слов
ActionEditorXMLTree=Дерево XML
ActionFileTypes=Типы файлов
ActionHexEditor=HEX-редактор
ActionHTMLExport=Экспорт в HTML
ActionImageView:t=Translation needed
ActionImageView=Image view
ActionJSONFormatter=Формат JSON
ActionMainMenu=Главное меню
ActionMarkdownPreview:t=Translation needed
ActionMarkdownPreview=Markdown preview
ActionMarkdownPreviewOptions=Параметры
ActionMenuBar=Панели меню
ActionMenuBarButtons=Кнопки
ActionMenuBarTabs=Вкладки
ActionOpen:h=Запись параметров в INI-файл
ActionOpen=Открыть...
ActionOutput=Вывод
ActionOutputTabs=Вкладки
ActionPDFView=Просмотр PDF
ActionPrint=Печать
ActionSaveAs:h=Чтение параметров из INI-файла
ActionSaveAs=Сохранить как...
ActionSkin=Обложка
ActionSkinButtons=Кнопки
ActionSkinEffects=Эффекты
ActionSkinFont=Шрифт
ActionSkinHints=Подсказки
ActionSkinScrollBars=Полосы прокрутки
ActionSkinStyles=Стили
ActionSQLFormatter=Формат SQL
ActionSQLFormatterCapitalization=Заглавные буквы
ActionSQLFormatterFormatting:t=Translation needed
ActionSQLFormatterFormatting=Formatting
ActionSQLFormatterIndentation=Отступ
ActionStatusBar=Строка состояния
ActionTitleBar=Строка заголовка
ActionToolbar=Панель инструментов
ActionToolbarOptions=Параметры
ActionXMLFormatter=Формат XML
Caption=Параметры

[OptionsHexEditorFrame]
CheckBoxAutosize=Размер автоматически
CheckBoxHexLowerCase=Hex нижний регистр
CheckBoxInsertMode:t=Translation needed
CheckBoxInsertMode=Insert mode
CheckBoxShowRuler=Показать линейку
ComboBoxCaretStyle=Стиль вставки

[OptionsHTMLExportFrame]
CheckBoxAddToClipboard:t=Translation needed
CheckBoxAddToClipboard=Add to clipboard
CheckBoxShowLineNumbers:t=Translation needed
CheckBoxShowLineNumbers=Show line numbers

[OptionsMainMenuFrame]
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontSizeCustom=Задать
RadioButtonFontSizeDefault=По умолчанию

[OptionsMarkdownPreviewFrame]
CheckBoxVisible=Показать
CheckBoxAutoSize=Размер автоматически
CheckBoxUseColorTheme:t=Translation needed
CheckBoxUseColorTheme=Use color theme
SpinEditWidth=Ширина
ComboBoxAlign=Выровнять

[OptionsMarkdownPreviewOptionsFrame]
CheckBoxBackslashEspacesHTMLTags:t=Translation needed
CheckBoxBackslashEspacesHTMLTags=Backslash escapes HTML tags
CheckBoxDisableForcedSpaces:t=Translation needed
CheckBoxDisableForcedSpaces=Disable the requirement of indenting sublists by 4 spaces for them to be nested
CheckBoxUnderline:t=Translation needed
CheckBoxUnderline=Disable underscore parsing as <em> or <strong>
CheckBoxSimplifiedAutoLink:t=Translation needed
CheckBoxSimplifiedAutoLink=Enable automatic linking in plain text URLs
CheckBoxEncodeEmails:t=Translation needed
CheckBoxEncodeEmails=Enable e-mail address automatic obfuscation
CheckBoxEmojis:t=Translation needed
CheckBoxEmojis=Enable emoji support
CheckBoxEllipsis:t=Translation needed
CheckBoxEllipsis=Enable horizontal ellipsis conversion
CheckBoxTasklists:t=Translation needed
CheckBoxTasklists=Enable support for GFM takslists
CheckBoxMentions:t=Translation needed
CheckBoxMentions=Enable support for github @mentions
CheckBoxCodeBlocks:t=Translation needed
CheckBoxCodeBlocks=Enable support for GFM code block style syntax (fenced codeblocks)
CheckBoxParseImgDimensions:t=Translation needed
CheckBoxParseImgDimensions=Enable support for setting image dimensions from within markdown syntax
CheckBoxStrikethrough:t=Translation needed
CheckBoxStrikethrough=Enable support for strikethrough syntax
CheckBoxTables:t=Translation needed
CheckBoxTables=Enable support for tables syntax
CheckBoxExcludeTrailingPunctuationFromURLs:t=Translation needed
CheckBoxExcludeTrailingPunctuationFromURLs=Exclude trailing punctuation from autolinked URLs
CheckBoxLiteralMiddleWordAsterisks:t=Translation needed
CheckBoxLiteralMiddleWordAsterisks=Literal middle word asterisks
CheckBoxOmitExtraWLInCodeBlocks:t=Translation needed
CheckBoxOmitExtraWLInCodeBlocks=Omit the trailing newline in a code block
CheckBoxSimpleLineBreaks:t=Translation needed
CheckBoxSimpleLineBreaks=Parse line breaks as <br/> in paragraphs (like GitHub does)
CheckBoxRequireSpaceBeforeHeadingText:t=Translation needed
CheckBoxRequireSpaceBeforeHeadingText= Require a space between # and header text
CheckBoxSplitAdjacentBlockquotes:t=Translation needed
CheckBoxSplitAdjacentBlockquotes=Split adjacent blockquotes
CheckBoxLiteralMiddleWordUnderscores:t=Translation needed
CheckBoxLiteralMiddleWordUnderscores=Treat underscores in middle of words as literal characters
SpinEditHeaderStartingLevel:t=Translation needed
SpinEditHeaderStartingLevel=Header starting level

[OptionsMenuBarFrame]
ActionAddDivider:h=Добавить разделитель
ActionAddDivider=Добавить разделитель
ActionAddButton:h=Добавить пункт
ActionAddButton=Добавить пункт
ActionDelete:h=Удалить
ActionDelete=Удалить
ActionMoveDown:h=Переместить выбранный элемент вниз
ActionMoveDown=Вниз
ActionMoveUp:h=Переместить выбранный элемент вверх
ActionMoveUp=Вверх
ActionReset:h=Сброс пунктов меню
ActionReset=Сброс
VirtualDrawTree:0=Кнопка
VirtualDrawTree:h=Перемещайте элементы меню перетаскиванием. Вставка/удаление элементов меню кликом правой кнопкой всплывающее меню.

[OptionsMenuBarTabsFrame]
CheckBoxBoldActiveTab=Жирный шрифт активной вкладки
CheckBoxEnlargeActiveTab=Увеличить активную вкладку
CheckBoxShowMenu=Показать меню
GroupBoxTabsFont=Размер
GroupBoxTabsFontSize=Размер шрифта
RadioButtonTabsFontCustom=Задать
RadioButtonTabsFontDefault=По умолчанию
RadioButtonTabsFontSizeCustom=Задать
RadioButtonTabsFontSizeDefault=По умолчанию
SpinEditTabHeight=Высота
SpinEditTabMargin=Поле
SpinEditTabPadding=Отступ
SpinEditTabSpacing=Интервал

[OptionsMenuBarButtonsFrame]
CheckBoxBlended=Смешанный
CheckBoxGrayed=Серый
CheckBoxReflected=Отразить
GroupBoxButtonsFont=Шрифт
GroupBoxButtonsFontSize=Размер шрифта
GroupBoxDisabled=Отключено
GroupBoxIcons=Иконки
RadioButtonButtonsFontCustom=Задать
RadioButtonButtonsFontDefault=По умолчанию
RadioButtonButtonsFontSizeCustom=Задать
RadioButtonButtonsFontSizeDefault=По умолчанию
RadioButtonLargeIcons=Больше
RadioButtonSmallIcons=Маленькие
TrackEditBlend=Смешивание

[OptionsMenuBarItemsDialog]
Caption=Выбрать элементы
VirtualDrawTreeAddItems:0=Элементы

[OptionsOutputFrame]
CheckBoxShowCheckBox=Показать флажок
CheckBoxShowOnlyLineNumbers:t=Translation needed
CheckBoxShowOnlyLineNumbers=Show only line numbers
CheckBoxShowTreeLines=Показать дерево строк
CheckBoxUseExplorerTheme=Тема прводника
ComboBoxAlign=Выровнять
SpinEditIndent=Отступ
SpinEditMargin=Поле

[OptionsOutputTabsFrame]
CheckBoxBoldActiveTab=Жирный шрифт активной вкладки
CheckBoxCloseTabByDblClick=Закрывать вкладку двойным кликом
CheckBoxCloseTabByMiddleClick=Закрывать вкладку средним кликом
CheckBoxEnlargeActiveTab=Увеличить активную вкладку
CheckBoxMultiline=Многострочная
CheckBoxRightClickSelect=Выбор правой кнопкой
CheckBoxSaveTabs=Сохранить вкладки
CheckBoxShowFindInFilesButton=Показать кнопку 'Поиск' в файлах
CheckBoxShowIcon=Показать изображения
ComboBoxShowCloseButton=Показать кнопку 'Закрыть'
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontSizeCustom=Задать
RadioButtonFontSizeDefault=По умолчанию
SpinEditTabHeight=Высота
SpinEditTabMargin=Поле
SpinEditTabSpacing=Интервал

[OptionsImageViewFrame]
CheckBoxControlBarVisible=Показать
CheckBoxEnabled=Включить
ComboBoxControlBarAlign=Выровнять
ComboBoxZoom=Увеличить
GroupBoxControlBar=Панель управления 

[OptionsPDFViewFrame]
CheckBoxControlBarVisible=Показать
CheckBoxEnabled=Включить
CheckBoxSearchBarHighlightAll:t=Translation needed
CheckBoxSearchBarHighlightAll=Highlight all
CheckBoxSearchBarMatchCase=С учётом регистра
CheckBoxSearchBarToggleSearchBar=Показать/скрыть панель поиска
CheckBoxSearchBarVisible=Показать
CheckBoxSearchBarWholeWords=Только слова целиком
ComboBoxControlBarAlign=Выровнять
ComboBoxSearchBarAlign=Выровнять
ComboBoxZoom=Увеличить
GroupBoxControlBar=Панель управления 
GroupBoxSearchBar:t=Translation needed
GroupBoxSearchBar=Search bar

[OptionsPrintFrame]
CheckBoxColorsEnabled=Включить
CheckBoxLineNumbersInMargin=На полях
CheckBoxLineNumbersVisible=Показать
CheckBoxShowFooterLine=Показать нижний колонтитул
CheckBoxShowHeaderLine=Показать заголовок
CheckBoxShowOnlyPageNumber=Показать только номер страницы
CheckBoxUseRomanNumerals=Использовать римские цифры
CheckBoxVisibleDateTime=Показать
CheckBoxVisibleFilename=Показать
CheckBoxVisiblePageNumber=Показать
CheckBoxVisiblePrintedBy=Показать
CheckBoxWordWrap=Перенос слов
ComboBoxColorTheme=Цвет темы
GroupBoxAlignmentDateTime=Выравнивание
GroupBoxAlignmentFilename=Выравнивание
GroupBoxAlignmentPageNumber=Выравнивание
GroupBoxAlignmentPrintedBy=Выравнивание
GroupBoxColors=Цвета
GroupBoxDateTime=Дата и время
GroupBoxFilename=Имя файла
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
GroupBoxLineNumbers=Номера строк
GroupBoxMargins=Отступы
GroupBoxPageNumber=Номер страницы
GroupBoxPrintedBy=Печать
GroupBoxVerticalAlignmentDateTime=Равнение по вертикали
GroupBoxVerticalAlignmentFilename=Равнение по вертикали
GroupBoxVerticalAlignmentPageNumber=Равнение по вертикали
GroupBoxVerticalAlignmentPrintedBy=Равнение по вертикали
RadioButtonAlignmentLeftDateTime=Слева
RadioButtonAlignmentLeftFilename=Слева
RadioButtonAlignmentLeftPageNumber=Слева
RadioButtonAlignmentLeftPrintedBy=Слева
RadioButtonAlignmentRightDateTime=Справа
RadioButtonAlignmentRightFilename=Справа
RadioButtonAlignmentRightPageNumber=Справа
RadioButtonAlignmentRightPrintedBy=Справа
RadioButtonFontCustom=Задать
RadioButtonFontEditor=По умолчанию
RadioButtonFontSizeCustom=Задать
RadioButtonFontSizeEditor=По умолчанию
RadioButtonVerticalAlignmentFooterDateTime=Нижний колонтитул
RadioButtonVerticalAlignmentFooterFilename=Нижний колонтитул
RadioButtonVerticalAlignmentFooterPageNumber=Нижний колонтитул
RadioButtonVerticalAlignmentFooterPrintedBy=Нижний колонтитул
RadioButtonVerticalAlignmentHeaderDateTime=Заголовок
RadioButtonVerticalAlignmentHeaderFilename=Заголовок
RadioButtonVerticalAlignmentHeaderPageNumber=Заголовок
RadioButtonVerticalAlignmentHeaderPrintedBy=Заголовок
SpinEditMarginsBottom=Снизу
SpinEditMarginsLeft=Слева
SpinEditMarginsRight=Справа
SpinEditMarginsTop=Сверху
TabSheetHeadedAndFooter=Заголовок и нижний колонтитул
TabSheetOptions=Опции

[OptionsSQLFormatterCapitalizationFrame]
ComboBoxKeywords=Ключевые слова
ComboBoxNames=Имя
ComboBoxParameters=Параметры

[OptionsSQLFormatterFrame]
CheckBoxAlwaysVisible:t=Translation needed
CheckBoxAlwaysVisible=Always visible
CheckBoxSelectDefaultSQLHighlighter:t=Translation needed
CheckBoxSelectDefaultSQLHighlighter=Select default SQL highlighter

[OptionsJSONFormatterFrame]
CheckBoxAlwaysVisible:t=Translation needed
CheckBoxAlwaysVisible=Always visible
CheckBoxSelectJSONHighlighter:t=Translation needed
CheckBoxSelectJSONHighlighter=Select JSON highlighter

[OptionsXMLFormatterFrame]
CheckBoxAlwaysVisible:t=Translation needed
CheckBoxAlwaysVisible=Always visible
CheckBoxSelectXMLHighlighter:t=Translation needed
CheckBoxSelectXMLHighlighter=Select XML highlighter

[OptionsSQLFormatterFormattingFrame]
CheckBoxAlignKeywordsRightInStatements=Выровнять ключевые слова в утверждениях
CheckBoxBreakJoinOnSections=Разрыв соединения в разделах
CheckBoxExpandBetweenConditions=Расширить между условиями
CheckBoxExpandBooleanExpressions=Расширить логические выражения
CheckBoxExpandCaseStatements=Расширить операторы обращения
CheckBoxExpandCommaLists=Расширить списки запятых
CheckBoxExpandGroupByClause=Расширить предложение по группировке
CheckBoxExpandInLists=Расширить в списках
CheckBoxExpandInsertStatements=Расширить операторы вставки
CheckBoxExpandJoinOnBooleanExpressions=Расширить логические выражения
CheckBoxExpandOrderByClause=Расширить порядок по пунктам
CheckBoxSpaceAfterComma=Пробел после запятой
CheckBoxTrailingCommas=Запятые в конце

[OptionsSQLFormatterIndentationFrame]
CheckBoxRightPadColumnNames=Имена столбцов правой панели в разделе создания таблицы или представления
CheckBoxUseTab=Использовать закладки
SpinEditIndentLength=Длина

[OptionsStatusBarFrame]
CheckBoxAutoSizePanels:t=Translation needed
CheckBoxAutoSizePanels=Auto size panels
CheckBoxShowCaretPosition=Показать позицию знака вставки
CheckBoxShowCharacterCount=Показать количество символов
CheckBoxShowEditorZoom=Показать масштаб редактора
CheckBoxShowEncoding=Показать кодировку
CheckBoxShowFileOpeningTime=Показать время открытия файла
CheckBoxShowHints=Показать подсказки
CheckBoxShowKeyState=Показать режим вставки/перезаписи
CheckBoxShowLineCount:t=Translation needed
CheckBoxShowLineCount=Show line count
CheckBoxShowMacro=Показать макрос
CheckBoxShowModified=Показать изменённые
CheckBoxShowSelectionInfo=Показать информацию о выборе
CheckBoxShowSizeGrip=Показать размер фрагмента
CheckBoxVisible=Показать
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontSizeCustom=Задать
RadioButtonFontSizeDefault=По умолчанию

[OptionsTitleBarFrame]
CheckBoxMagnifier=Показать лупу
CheckBoxShowApplicationName=Показать имя приложения
CheckBoxShowColorTheme=Показать цветовую тему
CheckBoxShowEncoding=Показать кодировку
CheckBoxShowFavourite=Показать избранное
CheckBoxShowFileList=Показать список файлов
CheckBoxShowFilename=Показать имя файла
CheckBoxShowHighlighter=Показать подсветку синтаксиса
CheckBoxShowIcon=Показать иконку
CheckBoxShowMenu=Показать меню
CheckBoxUseSystemStyle=Использовать стиль системы
GroupBoxFont=Шрифт
GroupBoxFontSize=Размер шрифта
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontSizeCustom=Задать
RadioButtonFontSizeDefault=По умолчанию

[OptionsToolbarFrame]
ActionAddDivider:h=Добавить разделитель
ActionAddDivider=Добавить разделитель
ActionAddButton:h=Добавить пункт
ActionAddButton=Добавить пункт
ActionDelete:h=Удалить
ActionDelete=Удалить
ActionMoveDown:h=Переместить выбранный элемент вниз
ActionMoveDown=Вниз
ActionMoveUp:h=Переместить выбранный элемент вверх
ActionMoveUp=Вверх
ActionReset:h=Сброс пунктов меню
ActionReset=Сброс
VirtualDrawTree:0=Пункт меню
VirtualDrawTree:h=Перемещайте элементы меню перетаскиванием. Вставка/удаление элементов меню кликом правой кнопкой всплывающее меню.

[OptionsToolbarOptionsFrame]
GroupBoxBackground=Фон
GroupBoxIcons=Иконки
RadioButtonBackgroundHigh=Высокого качества
RadioButtonBackgroundLow=Низкого качества
RadioButtonBackgroundTransparent=Прозрачный
RadioButtonLargeIcons=Большие
RadioButtonSmallIcons=Маленькие
SpinEditMarginTop=Отступ сверху

[OptionsToolbarItemsDialog]
Caption=Выбрать пункты
VirtualDrawTreeAddItems:0=Пункт меню

[PrintPreviewForm]
ActionColors:h=Включение/выключение цветов
ActionColors=Цвета
ActionExit:h=Выйти из предпросмотра печати
ActionExit=Выйти
ActionFirst:h=Первая|Перейти на первую страницу
ActionFirst=Первая
ActionHighlight:h=Включение/выключение выделения
ActionHighlight=Выделить
ActionLast:h=Последняя|Перейти к последней странице
ActionLast=Последняя
ActionLineNumbers:h=Включение/выключение отображения номеров строк
ActionLineNumbers=Номера строк
ActionNext:h=Далее|Следующая страница
ActionNext=Следующая
ActionPrevious:h=Назад|Предыдущая страница
ActionPrevious=Предыдущая
ActionPrint:h=Печать|Печать документов
ActionPrint=Печать
ActionWordWrap:h=Включение/выключение переноса слов
ActionWordWrap=Перенос слов
ActionZoom:h=Увеличить|Увеличить больше/меньше
ActionZoom=Увеличить
ActionZoomIn:h=Увеличить
ActionZoomIn=Увеличить
ActionZoomOut:h=Уменьшить
ActionZoomOut=Уменьшить
Caption=Предпросмотр

[ReplaceDialog]
ActionClose=Закрыть
ActionFindNext=Искать далее
ActionReplace=Заменить
ActionReplaceAll=Заменить всё
ActionSearchEngine=Выбрать движок поиска
Caption=Замена
CheckBoxMatchCase=С учётом регистра
CheckBoxPromptOnReplace=Спрашивать при замене
CheckBoxSelectedOnly=Только в выделенном
CheckBoxWholeWords=Только слова целиком
ComboBoxSearchFor=Искать
GroupBoxDirection=Направление
GroupBoxOptions=Опции
GroupBoxOrigin=Источник
GroupBoxReplaceIn=Заменить 
RadioButtonActiveFile=Весь файл
RadioButtonAllOpenFiles=Все открытые файлы
RadioButtonDeleteLine=Удалить строку
RadioButtonDirectionBackward=Назад
RadioButtonDirectionForward=Вперёд
RadioButtonEntireScope=Весь объём
RadioButtonOriginFromCursor=От курсора
RadioButtonReplaceWith=Заменить на

[SearchForFilesForm]
Caption=Поиск по всем файлам
PanelSearchingFiles=Поиск файлов...

[ShortcutsForm]
Caption=Ярлыки
VirtualDrawTree:0=Ярлык
VirtualDrawTree:1=Заголовок
VirtualDrawTree:2=Подсказка

[OptionsSkinFrame]
CheckBoxActive=Включить поддержку обложек
CheckBoxExtendedBordersEnabled=Включить
CheckBoxExtendedBordersFull=Полные
ComboBoxOptimizingPriority=Оптимизация приоритетов
GroupBoxColorization=Расцвечивание
GroupBoxExtendedBorders=Границы окна
LabelBrightness=Яркость
LabelHueOffset=Смещение оттенка
LabelSaturation=Насыщенность
LabelTransparency=Прозрачность
SkinSelector=Обложка

[OptionsSkinButtonsFrame]
CheckBoxShowButtonFocusRect=Показать прямоугольный фокус кнопки
CheckBoxUseButtonColors=Использовать цвета кнопки

[OptionsSkinEffectsFrame]
CheckBoxAllowAeroBlurring=Разрешить размытие Aero
CheckBoxAllowAnimation=Разрешить анимацию
CheckBoxAllowGlowing=Разрешить свечение
CheckBoxAllowOuterEffects=Разрешить внешние эффекты
CheckBoxBlendOnMove=Смешивание формы при перемещении

[OptionsSkinFontFrame]
RadioButtonFontCustom=Задать
RadioButtonFontDefault=По умолчанию
RadioButtonFontFromSkin=Из обложки

[OptionsSkinHintsFrame]
CheckBoxHintAnimated=Анимировать
ComboBoxHintStyle=Стиль
SpinEditShowInterval=Интервал отображения (мс)
SpinEditHideInterval=Интервал скрытия (мс)

[OptionsSkinScrollBarsFrame]
CheckBoxArrowButtonsDefaultSize=Размер по умолчанию
CheckBoxArrowButtonsVisible=Показать
CheckBoxScrollWidthDefaultSize=Размер по умолчанию
GroupBoxArrowButtons=Кнопки со стрелкой
GroupBoxScrollBar=Полоса прокрутки
SpinEditArrowButtonsSize=Размер
SpinEditScrollWidthSize=Размер

[OptionsSkinStylesFrame]
CheckBoxDirectory:t=Translation needed
CheckBoxDirectory=Directory
CheckBoxFiles:t=Translation needed
CheckBoxFiles=Files
CheckBoxMenuBar:t=Translation needed
CheckBoxMenuBar=Menu bar
CheckBoxOutput:t=Translation needed
CheckBoxOutput=Output
CheckBoxUseCardGroupBoxStyle=Использовать стиль рамки группы закладок
ComboBoxArrowStyle=Стиль стрелки
GroupBoxSimplePageControl:t=Translation needed
GroupBoxSimplePageControl=Simple page control

[TabsSelectDialog]
Caption=Выбрать вкладку
VirtualDrawTree:0=Вкладка

[WarningMessage]
FileAccessError=Ошибка доступа к файлу %s.

[SaveChangesDialog]
Caption=Сохранить изменённые файлы
VirtualDrawTree:0=Файл
VirtualDrawTree:1=Путь

[ConnectDialog]
Caption=Подключиться
EditPassword=Пароль

[UploadDialog]
Caption=Загрузить
EditFilename=Имя файла
EditPath=Путь

[NewFolderDialog]
Caption=Новая папка
EditPath=Путь

[DirectoryTabSFTPDialog]
Caption=SFTP-соединение
CheckBoxSavePassword=Сохранить пароль
CheckBoxShowOutput=Показать вывод
EditPassword=Пароль
EditPort=Порт
EditPrivateKeyFile=Файл закрытого ключа
EditRootDirectory=Корневой каталог
EditServer=Сервер
EditTabName=Имя вкладки
EditUsername=Имя пользователя